import '../models/chronicle_models.dart';

/// Predefined chronicle entry data.
const List<ChronicleEntryData> kChronicleEntries = [
  ChronicleEntryData(
    id: 'jdn_1995076',
    startJdn: 1995076.5,
    title: {
      'en': 'Foundation of Arimaddana.',
      'my': 'Foundation of Arimaddana.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2031512',
    startJdn: 2031512.5,
    title: {'en': 'Foundation of Pagan.', 'my': 'Foundation of Pagan.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2107906',
    startJdn: 2107906.5,
    title: {
      'en':
          'ဂဝံကျောင်း ကျောက်စာ၊ လက်သည်းရှည်ဘုရား၊ ပုဂံမြို့၊ အနော်ရထာမင်းကြီး။ ကျောင်းပြု၍ ဆင်၊ မြင်း၊ လယ်၊ မြေလှူဒါန်း။ သကရစ် ၄၂၀ ဘဿနှစ် တပေါင်လ္ဆန် ၅ ရက် ၅ နိယ်လျှင် ဘုန်တန်ခိုဝ် ပ္လည်ာနှင် ပ္လည်စုံမ်စွာသော စ်အနောရဓါ မင်ကြီကာ ၁ သူမ္လင် လောက် အဓုံမ်ကိုဝ် ယရုယ် သ္ခိင်ကဝံ ထု၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၀။',
      'my':
          'ဂဝံကျောင်း ကျောက်စာ၊ လက်သည်းရှည်ဘုရား၊ ပုဂံမြို့၊ အနော်ရထာမင်းကြီး။ ကျောင်းပြု၍ ဆင်၊ မြင်း၊ လယ်၊ မြေလှူဒါန်း။ သကရစ် ၄၂၀ ဘဿနှစ် တပေါင်လ္ဆန် ၅ ရက် ၅ နိယ်လျှင် ဘုန်တန်ခိုဝ် ပ္လည်ာနှင် ပ္လည်စုံမ်စွာသော စ်အနောရဓါ မင်ကြီကာ ၁ သူမ္လင် လောက် အဓုံမ်ကိုဝ် ယရုယ် သ္ခိင်ကဝံ ထု၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2125483',
    startJdn: 2125483.5,
    title: {
      'en':
          'ပရိမ္မထီးလိုင်သျှင်ဘုရားကျောက်စာ၊ ထီးလှိုင်ရှင်ဘုရား၊ ပရိမ္မရွာ၊ မြောင်မြို့နယ်၊ စေတီတည်၍၊ ကျွန်၊ စပါး၊ ငရုတ်၊ ချင်း၊ ဆား၊ ငါးပိ စသည်လှူဒါန်း။ သကရဇ် ၄၆၉ ခူ မာဃ ဂံဝဇ္ဆိုဏ် သိရိ ဘဝနာ ဒိတျ ဝံင်္သ ရာဇာဓိ ရာဇာ။ မဟ ဗ္ဗလော ဇိနိတွာန ၊ မဟိံ သဗ္ဗံ နိဗာနံ သမ္ပတာရ ယန္တိ ။ ကုဆုန်လ္ဆန် ၁၀ ၅ နိယ် မိမိဖွာရာ ပရိမ်ပြည်နှိုက် ဓိလိုင်သျင် မင်ကြီ စေတီ တည်၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅ (က)။',
      'my':
          'ပရိမ္မထီးလိုင်သျှင်ဘုရားကျောက်စာ၊ ထီးလှိုင်ရှင်ဘုရား၊ ပရိမ္မရွာ၊ မြောင်မြို့နယ်၊ စေတီတည်၍၊ ကျွန်၊ စပါး၊ ငရုတ်၊ ချင်း၊ ဆား၊ ငါးပိ စသည်လှူဒါန်း။ သကရဇ် ၄၆၉ ခူ မာဃ ဂံဝဇ္ဆိုဏ် သိရိ ဘဝနာ ဒိတျ ဝံင်္သ ရာဇာဓိ ရာဇာ။ မဟ ဗ္ဗလော ဇိနိတွာန ၊ မဟိံ သဗ္ဗံ နိဗာနံ သမ္ပတာရ ယန္တိ ။ ကုဆုန်လ္ဆန် ၁၀ ၅ နိယ် မိမိဖွာရာ ပရိမ်ပြည်နှိုက် ဓိလိုင်သျင် မင်ကြီ စေတီ တည်၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2127136',
    startJdn: 2127136.5,
    title: {
      'en':
          'လှည်းထောင်ဘုရားကျောက်စာ၊ တောင်ပြုန်းကြီး၊ အလောင်းစည်သူမင်းကြီး။ ဘုရားတည်ကျောင်းပြု၍ မြေလှူဒါန်း။ သက္ကရာစ် ၄၇၃ ခု တန်စောင်မုန် လဆန် ဆဲရက် သောက်ကြာ နံနက် သရဝန် နက်သတ် နှစ်ဆဲ နှစ်လုံမ်လျှင် ပ္လုတဝ်မူ၏ ၊ ငါပ္လုသော ဖုရာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၄ (က)။',
      'my':
          'လှည်းထောင်ဘုရားကျောက်စာ၊ တောင်ပြုန်းကြီး၊ အလောင်းစည်သူမင်းကြီး။ ဘုရားတည်ကျောင်းပြု၍ မြေလှူဒါန်း။ သက္ကရာစ် ၄၇၃ ခု တန်စောင်မုန် လဆန် ဆဲရက် သောက်ကြာ နံနက် သရဝန် နက်သတ် နှစ်ဆဲ နှစ်လုံမ်လျှင် ပ္လုတဝ်မူ၏ ၊ ငါပ္လုသော ဖုရာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၄ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2149217',
    startJdn: 2149217.5,
    title: {
      'en':
          '၅၃၄ (*၅၃၉) ခု ။ ကုဆုန်လ္ဆန် ၂ ရျက် တနှင်လာညန် သန်ကောင်လွန်ပေသော ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-က)။',
      'my':
          '၅၃၄ (*၅၃၉) ခု ။ ကုဆုန်လ္ဆန် ၂ ရျက် တနှင်လာညန် သန်ကောင်လွန်ပေသော ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2150320',
    startJdn: 2150320.5,
    title: {
      'en':
          'သင်ကြီးငါယန်သင် ကျောက်စာ။ သိမ်နှင့်ပုထိုးပြု၍ ကျွန်၊ လယ်၊ ယာ၊ နွား၊ စသည့် လှူဒါန်း။ ... သကရစ် (၅၃) ၇ ခု ကြတီုက်နှစ် ကူဆူန်လ္ဆန် ၁၀ ရျာက် သုက္ကြာနိယ္အ်အာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃။ (ကြတိုက်နှစ်ဆိုပါက ၅၃၈ ဖြစ်သင့်သည်။)',
      'my':
          'သင်ကြီးငါယန်သင် ကျောက်စာ။ သိမ်နှင့်ပုထိုးပြု၍ ကျွန်၊ လယ်၊ ယာ၊ နွား၊ စသည့် လှူဒါန်း။ ... သကရစ် (၅၃) ၇ ခု ကြတီုက်နှစ် ကူဆူန်လ္ဆန် ၁၀ ရျာက် သုက္ကြာနိယ္အ်အာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃။ (ကြတိုက်နှစ်ဆိုပါက ၅၃၈ ဖြစ်သင့်သည်။)',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2152069',
    startJdn: 2152069.5,
    title: {
      'en':
          'ကျစွာမင် မိထွေးတော်ကျောင်း ကျောက်စာ။ သကရစ် ၅၄၁ ခု။ မာဃနှစ်။ တပိုဝ်ထွယ်လ္ဆုတ် (၅ ရျ)က်။ ၆ နိယ် သင်ကြီ ငထာသင်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၈။',
      'my':
          'ကျစွာမင် မိထွေးတော်ကျောင်း ကျောက်စာ။ သကရစ် ၅၄၁ ခု။ မာဃနှစ်။ တပိုဝ်ထွယ်လ္ဆုတ် (၅ ရျ)က်။ ၆ နိယ် သင်ကြီ ငထာသင်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2152959',
    startJdn: 2152959.5,
    title: {
      'en':
          'အိုနူသင် ကျောက်စာ၊ ကျွန် လှူဒါန်း။ သကရစ် ၅၄၄ ခု ဗိသျက်နှစ် မ္လယ်တာလဆုတ် ၇ ရျာက် သုကြာနိ ဖုန်အသည် ကြိယ် အိုနူသင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၁။',
      'my':
          'အိုနူသင် ကျောက်စာ၊ ကျွန် လှူဒါန်း။ သကရစ် ၅၄၄ ခု ဗိသျက်နှစ် မ္လယ်တာလဆုတ် ၇ ရျာက် သုကြာနိ ဖုန်အသည် ကြိယ် အိုနူသင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၁။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2153441',
    startJdn: 2153441.5,
    title: {
      'en':
          'စည်သူမင်းကြီး ကျောက်စာ။  သက္ကရစ် ၅၄၅ ခု စိသ နှစ် တန်ဆောင်မုန် လ္ဆန် ၃ ရျက် ကြာသပတေနိယ္အ်အာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၄ (ခ)။',
      'my':
          'စည်သူမင်းကြီး ကျောက်စာ။  သက္ကရစ် ၅၄၅ ခု စိသ နှစ် တန်ဆောင်မုန် လ္ဆန် ၃ ရျက် ကြာသပတေနိယ္အ်အာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၄ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2153574',
    startJdn: 2153574.5,
    title: {
      'en':
          'ပရိမ္မထီးလိုင်သျှင်ဘုရားကျောက်စာ၊ ထီးလှိုင်ရှင်ဘုရား၊ ပရိမ္မရွာ၊ မြောင်မြို့နယ်၊ အလောင်းစည်သူမင်းကြီး။ ဂူ ဘုရားပြု၍ လယ်မြေလှူဒါန်း။ သက္ကစ် ၅၄၅ ခု စိတ်သနှစ် တပေါင်လ္ဆုတ် ၅ ရျက် ၅ နိယ်လျှင် နတ်ရွာသဖွယ် ဖ္လစ်သော ပရိမ်မည်သပြည်နှိုက် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅ (ခ)။',
      'my':
          'ပရိမ္မထီးလိုင်သျှင်ဘုရားကျောက်စာ၊ ထီးလှိုင်ရှင်ဘုရား၊ ပရိမ္မရွာ၊ မြောင်မြို့နယ်၊ အလောင်းစည်သူမင်းကြီး။ ဂူ ဘုရားပြု၍ လယ်မြေလှူဒါန်း။ သက္ကစ် ၅၄၅ ခု စိတ်သနှစ် တပေါင်လ္ဆုတ် ၅ ရျက် ၅ နိယ်လျှင် နတ်ရွာသဖွယ် ဖ္လစ်သော ပရိမ်မည်သပြည်နှိုက် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2157668',
    startJdn: 2157668.5,
    title: {
      'en':
          'သူကြွယ်ကျောင်း ကျောက်စာ။ သက္ကရစ် ၅၅၇ ခု နံယုံလ္ဆန် ၇ ရျက် ၄ နေ့လျှင်  ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၉၀။',
      'my':
          'သူကြွယ်ကျောင်း ကျောက်စာ။ သက္ကရစ် ၅၅၇ ခု နံယုံလ္ဆန် ၇ ရျက် ၄ နေ့လျှင်  ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၉၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2158888',
    startJdn: 2158888.5,
    title: {
      'en':
          'မောင်းမ စောခင်မိငယ် ကျောက်စာ။ ဓမ္မရာဇိကဘုရား၊ ပုဂံမြို့။ လှူဒါန်း။ သကရစ် ၅၆၀ ဖဿနှစ် သန္တူလ္ဆုတ် ၂ ရျက် သုကြာနိယ် မောင်မ ခင်မိငယ် ဖုရှာ လှူသော တန်ရောက်လယ် ၅၀ လှူ၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃၇။ <br/><br/> ပုဂံ ရွှေကျာင်း အရှေ့ဂူ ကျောက်စာ။  သကရစ် ၅၆၀ ဖဿနှစ် သန္တူလ္ဆုတ် ၂ ရျက် သောကြာနိယ်အာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၇။',
      'my':
          'မောင်းမ စောခင်မိငယ် ကျောက်စာ။ ဓမ္မရာဇိကဘုရား၊ ပုဂံမြို့။ လှူဒါန်း။ သကရစ် ၅၆၀ ဖဿနှစ် သန္တူလ္ဆုတ် ၂ ရျက် သုကြာနိယ် မောင်မ ခင်မိငယ် ဖုရှာ လှူသော တန်ရောက်လယ် ၅၀ လှူ၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃၇။ <br/><br/> ပုဂံ ရွှေကျာင်း အရှေ့ဂူ ကျောက်စာ။  သကရစ် ၅၆၀ ဖဿနှစ် သန္တူလ္ဆုတ် ၂ ရျက် သောကြာနိယ်အာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2159759',
    startJdn: 2159759.5,
    title: {
      'en':
          'စည်သူမင်းကြီး ကျောက်စာ၊ စည်သူမင်းကြီးလင်မယား။ ပုထိုး၊ ဂူ၊ တံတိုင်းပြု၍ ကျွန်၊ လယ် စသည်လှူဒါန်း။ သက္ကရစ် ၅၆၂ ခု ကြတိုက်နှစ် တပေါင်လ္ဆုန် ၅ ရျက် ၂ နိယ် သစ်မတီအရပ်နှိုက် စည်သူမင်ကြီသည် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၃။',
      'my':
          'စည်သူမင်းကြီး ကျောက်စာ၊ စည်သူမင်းကြီးလင်မယား။ ပုထိုး၊ ဂူ၊ တံတိုင်းပြု၍ ကျွန်၊ လယ် စသည်လှူဒါန်း။ သက္ကရစ် ၅၆၂ ခု ကြတိုက်နှစ် တပေါင်လ္ဆုန် ၅ ရျက် ၂ နိယ် သစ်မတီအရပ်နှိုက် စည်သူမင်ကြီသည် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2161311',
    startJdn: 2161311.5,
    title: {
      'en':
          'သင်ငါနှစ်လို့သင် ကျောက်စာ၊ သင်ငါနှစ်လို့သင်။ ဂူဘုရားအားကျွန်၊ နွား၊ လယ် စသည်လှူဒါန်း။ မ္လတ်စွာသော ပုရှာသ္ခိင် သာသနာ လွန်လိယ်ပြီသော အနှစ် ၁၇၅၀ သကရစ် ၅၆၇ စေယ်နှစ် ။ ကုဆုန်လ ပ္လည် စနိယ်နိယ်အာ သင်ငါနှစ်လိုဝ္အ်သင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၄ (က ၊ ခ)။ ( က ရှိ ၅၆၇ မှာ သာသနာနှစ်နှင့် မကိုက်ပဲ ခ ရှိ ၅၆၈ မှာကိုက်ညီသည်။ သို့သော် စေယ်နှစ်ဆိုပါက က ရှိ ၅၆၇ မှာကိုက်ညီသည်။ မောင်းမ စောခင်မိငယ် ကျောက်စာ အရ ၅၆၈ ကဆုန်လပြည့်မှာ ဗုဒ္ဓဟူးဖြစ်သဖြင့်၊ ဤ ခုနှစ်မှာ ၅၆၇ ဟု ယူဆရသည်။)',
      'my':
          'သင်ငါနှစ်လို့သင် ကျောက်စာ၊ သင်ငါနှစ်လို့သင်။ ဂူဘုရားအားကျွန်၊ နွား၊ လယ် စသည်လှူဒါန်း။ မ္လတ်စွာသော ပုရှာသ္ခိင် သာသနာ လွန်လိယ်ပြီသော အနှစ် ၁၇၅၀ သကရစ် ၅၆၇ စေယ်နှစ် ။ ကုဆုန်လ ပ္လည် စနိယ်နိယ်အာ သင်ငါနှစ်လိုဝ္အ်သင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၄ (က ၊ ခ)။ ( က ရှိ ၅၆၇ မှာ သာသနာနှစ်နှင့် မကိုက်ပဲ ခ ရှိ ၅၆၈ မှာကိုက်ညီသည်။ သို့သော် စေယ်နှစ်ဆိုပါက က ရှိ ၅၆၇ မှာကိုက်ညီသည်။ မောင်းမ စောခင်မိငယ် ကျောက်စာ အရ ၅၆၈ ကဆုန်လပြည့်မှာ ဗုဒ္ဓဟူးဖြစ်သဖြင့်၊ ဤ ခုနှစ်မှာ ၅၆၇ ဟု ယူဆရသည်။)',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2161665',
    startJdn: 2161665.5,
    title: {
      'en':
          'မောင်းမ စောခင်မိငယ် ကျောက်စာ။ ဓမ္မရာဇိကဘုရား၊ ပုဂံမြို့။ လှူဒါန်း။ သကရစ် ၅၆၈ ခု ပိသျက်နှစ် ကဆုန်လပ္လည် ပုတ္တဟူနိယ် မောင်မ စဝ်ခင်မိငယ် ဖုရှာကိုဝ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃၇။',
      'my':
          'မောင်းမ စောခင်မိငယ် ကျောက်စာ။ ဓမ္မရာဇိကဘုရား၊ ပုဂံမြို့။ လှူဒါန်း။ သကရစ် ၅၆၈ ခု ပိသျက်နှစ် ကဆုန်လပ္လည် ပုတ္တဟူနိယ် မောင်မ စဝ်ခင်မိငယ် ဖုရှာကိုဝ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2162746',
    startJdn: 2162746.5,
    title: {
      'en':
          'မင်းမတ်နဂါပိုရ်မိဖွါးကျောက်စာ။ သကရစ် ၅၇၁ ခု အာသိန်နှစ်၊ ကုဆုန်လ္ဆန် ၇ ရျက် ၅ နိယ်အာ၊ မင်မတ် နဂါပိုရ် မိဖွါ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃။  ',
      'my':
          'မင်းမတ်နဂါပိုရ်မိဖွါးကျောက်စာ။ သကရစ် ၅၇၁ ခု အာသိန်နှစ်၊ ကုဆုန်လ္ဆန် ၇ ရျက် ၅ နိယ်အာ၊ မင်မတ် နဂါပိုရ် မိဖွါ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2163605',
    startJdn: 2163605.5,
    title: {
      'en': 'Htilominlo comes to power.',
      'my': 'Htilominlo comes to power.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2169199',
    startJdn: 2169199.5,
    title: {
      'en':
          'ဖျက္ကသု ကျောက်စာ။ ဖျက္ကသုမင်း။ လယ်၊ မြေ လှူဒါန်း။ သာကရစ် ၅၈၈ ခု ပုဿနှစ် နတ္တဝ်လဆု . ၅ သုကြာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၉။',
      'my':
          'ဖျက္ကသု ကျောက်စာ။ ဖျက္ကသုမင်း။ လယ်၊ မြေ လှူဒါန်း။ သာကရစ် ၅၈၈ ခု ပုဿနှစ် နတ္တဝ်လဆု . ၅ သုကြာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2170481',
    startJdn: 2170481.5,
    title: {
      'en':
          'မကွေးသူ မုဆိုးမ ကျောက်စာ။ သကရစ် ၅၉၂ ခု ဖ္လကိုန်  မ္လွယ်တာလဆန် ၅ ရျက် စနိယ်နိယ်အာ ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၈။',
      'my':
          'မကွေးသူ မုဆိုးမ ကျောက်စာ။ သကရစ် ၅၉၂ ခု ဖ္လကိုန်  မ္လွယ်တာလဆန် ၅ ရျက် စနိယ်နိယ်အာ ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2171439',
    startJdn: 2171439.5,
    title: {
      'en':
          'အမတ်အစလပိဇည်တို့ကျောက်စာ။ သကရစ် ၅၉၄ ခု တပိုဝ်ထွယ် လဆု ၂ င်္ရျ သုကြနိ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၉။  ',
      'my':
          'အမတ်အစလပိဇည်တို့ကျောက်စာ။ သကရစ် ၅၉၄ ခု တပိုဝ်ထွယ် လဆု ၂ င်္ရျ သုကြနိ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၉။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2172263',
    startJdn: 2172263.5,
    title: {
      'en':
          'သူကြွယ်ငါစပါသင် ကျောက်စာ။ သကရစ် ၅၉၇ ခုကုဆုန် လပ္လည္အ် ပုတ္တဟောနိယ္အ် သုကြွယ် ငါစပါသင် ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၈၉(က)။',
      'my':
          'သူကြွယ်ငါစပါသင် ကျောက်စာ။ သကရစ် ၅၉၇ ခုကုဆုန် လပ္လည္အ် ပုတ္တဟောနိယ္အ် သုကြွယ် ငါစပါသင် ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၈၉(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2172725',
    startJdn: 2172725.5,
    title: {
      'en':
          'သိရိတရိဘဝနာတိတျပဝရ မဟာ ဓမ္မရာဇာ စေည်ု။ ဘုရားတည်၊ ကျောင်းဆောက်၍၊ လယ်၊ မြေ လှူဒါန်း။ သက္ကရာဇ် ၅၉၈ ကြတိုက်နှစ် တော်သလင်လဆန် ၇ ရက် ဗုဒ္ဓဟုနိယ်၊ သိရိ တရိ ဘဝနာ တိတျ ပဝရ မဟာဓမ္မရာဇာ စေည်ု အမည်တော်ဟိသော ဖုရာဆုတောင်သော ၊ မင်မြတ်သှ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၈။',
      'my':
          'သိရိတရိဘဝနာတိတျပဝရ မဟာ ဓမ္မရာဇာ စေည်ု။ ဘုရားတည်၊ ကျောင်းဆောက်၍၊ လယ်၊ မြေ လှူဒါန်း။ သက္ကရာဇ် ၅၉၈ ကြတိုက်နှစ် တော်သလင်လဆန် ၇ ရက် ဗုဒ္ဓဟုနိယ်၊ သိရိ တရိ ဘဝနာ တိတျ ပဝရ မဟာဓမ္မရာဇာ စေည်ု အမည်တော်ဟိသော ဖုရာဆုတောင်သော ၊ မင်မြတ်သှ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173332',
    startJdn: 2173332.5,
    title: {
      'en':
          'မဟာဂေါတမဘုရားကျောက်စာ။ သကရစ် ၆၀၀ ပုဿနှစ် တန်ခူလ္ဆုတ် ၅ ရျက် တနှင်လာနိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁။  ',
      'my':
          'မဟာဂေါတမဘုရားကျောက်စာ။ သကရစ် ၆၀၀ ပုဿနှစ် တန်ခူလ္ဆုတ် ၅ ရျက် တနှင်လာနိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173680',
    startJdn: 2173680.5,
    title: {
      'en':
          'အမတ်အစလပိဇည်တို့ကျောက်စာ။ သကရစ် ၆၀၁ ခု။ တန်ထူလပ္လည် စနိယ်နိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၉။  ',
      'my':
          'အမတ်အစလပိဇည်တို့ကျောက်စာ။ သကရစ် ၆၀၁ ခု။ တန်ထူလပ္လည် စနိယ်နိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၉။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173699',
    startJdn: 2173699.5,
    title: {
      'en':
          'ငကောင်ရင်သင်ဂူကျောင်းကျောက်စာ။ သက္ကရစ် ၆၀၁ ခု၊ မာခနှစ် ကဆုန်လဆန် ၅ ရျက် ကြာသပတေနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၄။  ',
      'my':
          'ငကောင်ရင်သင်ဂူကျောင်းကျောက်စာ။ သက္ကရစ် ၆၀၁ ခု၊ မာခနှစ် ကဆုန်လဆန် ၅ ရျက် ကြာသပတေနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၄။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173825',
    startJdn: 2173825.5,
    title: {
      'en':
          'လေးမျက်နှာဘုရား ကျောက်စာ။ သကရစ် ၆၀၁ မာခနှစ် တ်သလင်လဆန် ၁၃ ရျက် ကြသပတေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၂။',
      'my':
          'လေးမျက်နှာဘုရား ကျောက်စာ။ သကရစ် ၆၀၁ မာခနှစ် တ်သလင်လဆန် ၁၃ ရျက် ကြသပတေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၂။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173827',
    startJdn: 2173827.5,
    title: {
      'en':
          'သင်လျင်သိရတ်မောင်နှံကျောက်စာ။ သကရစ် ၆၀၁ ။ မာခနှစ် တဝ်သလင်လဆန် ၁၅ ရျက် စနိယ်နိယ္အ်လျှင် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၀။  ',
      'my':
          'သင်လျင်သိရတ်မောင်နှံကျောက်စာ။ သကရစ် ၆၀၁ ။ မာခနှစ် တဝ်သလင်လဆန် ၁၅ ရျက် စနိယ်နိယ္အ်လျှင် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၀။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173980',
    startJdn: 2173980.5,
    title: {
      'en':
          'ရတနာသုံးပါးအားကျွန်လယ်လှူသောကျောက်စာ။ သကရစ် ၆၀၁ ခု မာခါနှစ် တပိုဝ်ထွယ် လဆုတ် ၅ ရျက် သုကြာနိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၆။  ',
      'my':
          'ရတနာသုံးပါးအားကျွန်လယ်လှူသောကျောက်စာ။ သကရစ် ၆၀၁ ခု မာခါနှစ် တပိုဝ်ထွယ် လဆုတ် ၅ ရျက် သုကြာနိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၆။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2173991',
    startJdn: 2173991.5,
    title: {
      'en':
          'မင်းမတ်နဂါပိုရ်မိဖွါးကျောက်စာ။ သကရစ် ၆၀၁ ခု မာဃနှစ်၊ တပေါင်လ္ဆန် ၁ ရျက် ၂ နိယ်အာ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃။  ',
      'my':
          'မင်းမတ်နဂါပိုရ်မိဖွါးကျောက်စာ။ သကရစ် ၆၀၁ ခု မာဃနှစ်၊ တပေါင်လ္ဆန် ၁ ရျက် ၂ နိယ်အာ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃။  ',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174151',
    startJdn: 2174151.5,
    title: {
      'en':
          'ဖုန်းသည် သင်ကြီး ငါပံသင် ကျောက်စာ။ သကရစ် ၆၀၂ ခု ကုဆုန်လဆန် ၁၂ ရျက် တနှင်္လာနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၅။',
      'my':
          'ဖုန်းသည် သင်ကြီး ငါပံသင် ကျောက်စာ။ သကရစ် ၆၀၂ ခု ကုဆုန်လဆန် ၁၂ ရျက် တနှင်္လာနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၅။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174152',
    startJdn: 2174152.5,
    title: {
      'en':
          'သူကြွယ် ငစုယ်သင် ဘုရားကြီး ကျောက်စာ။ သကရစ် ၆၀၂ ခု ဖုတ်သနှစ် မ္လွယ်တာလ္ဆန် ၁၃ ရျက် ၄ နိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၁။',
      'my':
          'သူကြွယ် ငစုယ်သင် ဘုရားကြီး ကျောက်စာ။ သကရစ် ၆၀၂ ခု ဖုတ်သနှစ် မ္လွယ်တာလ္ဆန် ၁၃ ရျက် ၄ နိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၁။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174154',
    startJdn: 2174154.5,
    title: {
      'en':
          'ဖုန်မ္လတ်ပုရှာ မယ်တော် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၀၂ ခု ဖ္လကိုန် သံဝစ္ဆိုဝ်ရနှစ် မ္လယ်တာလပ္လည် တန်နှင်လာနိယ် ဖုန်မ္လတ်ပုရှာ မယ်တော်ကာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၈။',
      'my':
          'ဖုန်မ္လတ်ပုရှာ မယ်တော် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၀၂ ခု ဖ္လကိုန် သံဝစ္ဆိုဝ်ရနှစ် မ္လယ်တာလပ္လည် တန်နှင်လာနိယ် ဖုန်မ္လတ်ပုရှာ မယ်တော်ကာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၂၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174163',
    startJdn: 2174163.5,
    title: {
      'en':
          'မကွေးသူ မုဆိုးမ ကျောက်စာ။ သကရစ် ၆၀၂ ခု  မ္လွယ်တာလဆုတ် ၉ ရျက်ကြသပတိယ်နိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၉။',
      'my':
          'မကွေးသူ မုဆိုးမ ကျောက်စာ။ သကရစ် ၆၀၂ ခု  မ္လွယ်တာလဆုတ် ၉ ရျက်ကြသပတိယ်နိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၁၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174272',
    startJdn: 2174272.5,
    title: {
      'en':
          'ငဇဝ်သင် ကျောက်စာ။ သကရစ် ၆၀၂ ခု  ဖလကိုန်နှစ် တန်ဆောင်မှုန် လပ္လည် သတင် တနှင်လာနိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၀။',
      'my':
          'ငဇဝ်သင် ကျောက်စာ။ သကရစ် ၆၀၂ ခု  ဖလကိုန်နှစ် တန်ဆောင်မှုန် လပ္လည် သတင် တနှင်လာနိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174410',
    startJdn: 2174410.5,
    title: {
      'en':
          'ဖွားစောခေါ် အမိပုရှာစော ကျောက်စာ။ သကရစ် ၆၀၃ ခု။ တန်ခူလဆန် ၇ ရျက်။ တနှင်လာနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၉။',
      'my':
          'ဖွားစောခေါ် အမိပုရှာစော ကျောက်စာ။ သကရစ် ၆၀၃ ခု။ တန်ခူလဆန် ၇ ရျက်။ တနှင်လာနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174447',
    startJdn: 2174447.5,
    title: {
      'en':
          'ဖွားစောခေါ် အမိပုရဟားစော ကျောက်စာ။ သကရစ် ၆၀၃ ခု။ စယ်နှစ်။ ကုဆုန်လပ္လည် ဗုဒ္ဓဟူနိယ္အ်နှိုက် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၄။',
      'my':
          'ဖွားစောခေါ် အမိပုရဟားစော ကျောက်စာ။ သကရစ် ၆၀၃ ခု။ စယ်နှစ်။ ကုဆုန်လပ္လည် ဗုဒ္ဓဟူနိယ္အ်နှိုက် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၄။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174617',
    startJdn: 2174617.5,
    title: {
      'en':
          'သ္ခိင်ဖွားကြီးမြေး စိုးမင်း ကျောက်စာ။ သကရစ် ၆၀၃ ခု စယ်နှစ် တန်ဆောင်မှုန်လ္ဆန် ၈ ရ္ယာက် သုကြာနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၇။',
      'my':
          'သ္ခိင်ဖွားကြီးမြေး စိုးမင်း ကျောက်စာ။ သကရစ် ၆၀၃ ခု စယ်နှစ် တန်ဆောင်မှုန်လ္ဆန် ၈ ရ္ယာက် သုကြာနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၂၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174772',
    startJdn: 2174772.5,
    title: {
      'en':
          'ရွှေဂူဘုရား ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဗိသျက် သံဝစ္ဆိုဝ်နှစ် တန်ခူလဆန် ၁၃ ရျက် ကြဿပတိယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၆။',
      'my':
          'ရွှေဂူဘုရား ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဗိသျက် သံဝစ္ဆိုဝ်နှစ် တန်ခူလဆန် ၁၃ ရျက် ကြဿပတိယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၆။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174798',
    startJdn: 2174798.5,
    title: {
      'en':
          'ကျစွာမင် မိထွေးတော်ကျောင်း ကျောက်စာ။ သကရစ် ၆၀၄ ခု။ ကဆုန်လ္ဆန် ၁၀ ရျက် သုကြာနိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၉။',
      'my':
          'ကျစွာမင် မိထွေးတော်ကျောင်း ကျောက်စာ။ သကရစ် ၆၀၄ ခု။ ကဆုန်လ္ဆန် ၁၀ ရျက် သုကြာနိယ်... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174804',
    startJdn: 2174804.5,
    title: {
      'en':
          'သံဗျင် အစလဘိရစ် ဒါနပတိ မောင်နှံ ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဖ္လကုန်နှစ် ကုဆုန်လ ပ္လည် ပုတ္တ ဟူနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃၀။',
      'my':
          'သံဗျင် အစလဘိရစ် ဒါနပတိ မောင်နှံ ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဖ္လကုန်နှစ် ကုဆုန်လ ပ္လည် ပုတ္တ ဟူနိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174913',
    startJdn: 2174913.5,
    title: {
      'en':
          'မြေအတွက် အချင်းများသော ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဗိသျက်နှစ် နံကာလဆန် ၆ ရျက် ပုတ္တဟူနိယ် ... ။ ကျစွာမင် မိထွေးတော်ကျောင်း ကျောက်စာ။ သကရစ် ၆၀၄ ခု နံကာလ္ဆန် ၆ ရျက် ပုတ္တဟူနိယ်အာ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၂၊ ၅၉။',
      'my':
          'မြေအတွက် အချင်းများသော ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဗိသျက်နှစ် နံကာလဆန် ၆ ရျက် ပုတ္တဟူနိယ် ... ။ ကျစွာမင် မိထွေးတော်ကျောင်း ကျောက်စာ။ သကရစ် ၆၀၄ ခု နံကာလ္ဆန် ၆ ရျက် ပုတ္တဟူနိယ်အာ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၂၊ ၅၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2174951',
    startJdn: 2174951.5,
    title: {
      'en':
          'သူကြွယ် ငါမြှောက်သင် ကျောက်စာ။ သကရစ် ၆၀၄ ခု ပိသျက် သံမဆ္စိုရာနှာစ် တဝ်သ္လင်လပ္လည် ကြတ္သပတိယ်နိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၃။',
      'my':
          'သူကြွယ် ငါမြှောက်သင် ကျောက်စာ။ သကရစ် ၆၀၄ ခု ပိသျက် သံမဆ္စိုရာနှာစ် တဝ်သ္လင်လပ္လည် ကြတ္သပတိယ်နိယ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2175005',
    startJdn: 2175005.5,
    title: {
      'en':
          'သ္ခိင် ငမည်သင် ဂုဏာတိရိတ် ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဗိသျက်နှစ် တန်ဆောင်မှုန်လဆန် ၁(၀) ရျက် ကြသပတိယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၄။',
      'my':
          'သ္ခိင် ငမည်သင် ဂုဏာတိရိတ် ကျောက်စာ။ သကရစ် ၆၀၄ ခု ဗိသျက်နှစ် တန်ဆောင်မှုန်လဆန် ၁(၀) ရျက် ကြသပတိယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၅၄။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2175054',
    startJdn: 2175054.5,
    title: {
      'en':
          'ညောင်ရံကြီး သမီး ကျောက်စာ။ သကရစ် ၆၀၄ ခု။ ပိသျက်နှစ်။ နတ်တော် လဆုတ် ၁၄ ရျက် သတင် ကြဿတိယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃၃။',
      'my':
          'ညောင်ရံကြီး သမီး ကျောက်စာ။ သကရစ် ၆၀၄ ခု။ ပိသျက်နှစ်။ နတ်တော် လဆုတ် ၁၄ ရျက် သတင် ကြဿတိယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2175057',
    startJdn: 2175057.5,
    title: {
      'en':
          'ညောင်ရံကြီး သမီး ကျောက်စာ။ သကရစ် ၆၀၄ ခု။ ပိသျက်နှစ်။ ပ္လသိုဝ်လဆန် ၃ ရျက် တန်နှင်ကုနုယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃၃။',
      'my':
          'ညောင်ရံကြီး သမီး ကျောက်စာ။ သကရစ် ၆၀၄ ခု။ ပိသျက်နှစ်။ ပ္လသိုဝ်လဆန် ၃ ရျက် တန်နှင်ကုနုယ်နိယ္အ် ... ။ ရှေးဟောင်းမြန်မာကျောက်စာများ-ဒုတိယတွဲ။ စာမျက်နှာ ၃၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2175600',
    startJdn: 2175600.5,
    title: {
      'en':
          'ဖုမ်မသင်ကြံကျောင်းကျောက်စာ။ သကရာဇ် ၆၀၅ ခု အာသိတ်နှစ် (နှစ်အမည်အရ ၆၀၆ ဖြစ်မှ ကိုက်ညီမည်) မ္လယ်တာလ္ဆန် ၁၅ ရျက် ဝါဆိုသတ .... င် တနှင်လာနိယ်လျှင်။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၅၇။',
      'my':
          'ဖုမ်မသင်ကြံကျောင်းကျောက်စာ။ သကရာဇ် ၆၀၅ ခု အာသိတ်နှစ် (နှစ်အမည်အရ ၆၀၆ ဖြစ်မှ ကိုက်ညီမည်) မ္လယ်တာလ္ဆန် ၁၅ ရျက် ဝါဆိုသတ .... င် တနှင်လာနိယ်လျှင်။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၅၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2181040',
    startJdn: 2181040.5,
    title: {
      'en':
          'ငါလပ်သင် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၂၁ ခု အာသတ်နှစ် နံယုန်လဆုတ် ၅ ရျက် ၃ နိယ္အ် ငါလပ်သင် က္လောင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၂ (က)။',
      'my':
          'ငါလပ်သင် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၂၁ ခု အာသတ်နှစ် နံယုန်လဆုတ် ၅ ရျက် ၃ နိယ္အ် ငါလပ်သင် က္လောင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၂ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2181652',
    startJdn: 2181652.5,
    title: {
      'en':
          'မဟာရစ်စေတီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၂၂ ခု ကြတိုက်နှစ် တပိုဝ္အ်ထွယ်လ္ဆန် ၁၂ ရျက် သုကြာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇ (က)။',
      'my':
          'မဟာရစ်စေတီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၂၂ ခု ကြတိုက်နှစ် တပိုဝ္အ်ထွယ်လ္ဆန် ၁၂ ရျက် သုကြာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2182117',
    startJdn: 2182117.5,
    title: {
      'en':
          'အိုန်ရောက်သင် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၂၄ ခု ပုတ် သနှစ် ကဆုန်လဆန် ၈ ရျက် တနင်ကနုယ်နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၁။',
      'my':
          'အိုန်ရောက်သင် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၂၄ ခု ပုတ် သနှစ် ကဆုန်လဆန် ၈ ရျက် တနင်ကနုယ်နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၁။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2182408',
    startJdn: 2182408.5,
    title: {
      'en':
          'စိုးမင်းကြာသဝတ် လင်မယား ကျောက်စာ။  သကရစ် ၆၂၄ ခု ပုဿနှစ် တပေါင်လ္ဆန် ၃ ရျက် သောက်ြာနိယ်အာ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၀၀ (က)။',
      'my':
          'စိုးမင်းကြာသဝတ် လင်မယား ကျောက်စာ။  သကရစ် ၆၂၄ ခု ပုဿနှစ် တပေါင်လ္ဆန် ၃ ရျက် သောက်ြာနိယ်အာ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၀၀ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2185816',
    startJdn: 2185816.5,
    title: {
      'en':
          'မင်းဖကြီး ကျောက်စာ။ လှူဒါန်း။ .ကရစ် ၆၃၄ ခု ကြတိုက်နှစ်တေ မ္လွယ်တာလဆ. ၁၃ ရျက် ကြာသပတိယ်နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၀။',
      'my':
          'မင်းဖကြီး ကျောက်စာ။ လှူဒါန်း။ .ကရစ် ၆၃၄ ခု ကြတိုက်နှစ်တေ မ္လွယ်တာလဆ. ၁၃ ရျက် ကြာသပတိယ်နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2186041',
    startJdn: 2186041.5,
    title: {
      'en':
          'ရမ္မနာသင် ကျောက်စာ။ လှူဒါန်း။ သဂ္ဂရစ် ၆၃၄ ခု ကြတိုက်နှစ် (တပို)ဝ်ထွယ်လဆန် ၃ ရျက် ၆ နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၃။',
      'my':
          'ရမ္မနာသင် ကျောက်စာ။ လှူဒါန်း။ သဂ္ဂရစ် ၆၃၄ ခု ကြတိုက်နှစ် (တပို)ဝ်ထွယ်လဆန် ၃ ရျက် ၆ နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2186172',
    startJdn: 2186172.5,
    title: {
      'en':
          'မြင်းခုန်တိုင် သ္ခိင်မဟာထီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၃၅ ခု မြိက္ကသိရ်နှစ် နံယုန်လဆန် ၁၃ ရျာက် ဗုဒ္ဓဟော နံနက် နိယ်တက် ၄၅ ဖ္လွါလျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၄။',
      'my':
          'မြင်းခုန်တိုင် သ္ခိင်မဟာထီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၃၅ ခု မြိက္ကသိရ်နှစ် နံယုန်လဆန် ၁၃ ရျာက် ဗုဒ္ဓဟော နံနက် နိယ်တက် ၄၅ ဖ္လွါလျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၄။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2188270',
    startJdn: 2188270.5,
    title: {
      'en':
          'ငါကြည်စုသင် လင်မယား ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၄၀ ခု ။ တပေါင်လပ္လည် တန်နှင်လာနိယ် ။  ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၈ (ခ)။',
      'my':
          'ငါကြည်စုသင် လင်မယား ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၄၀ ခု ။ တပေါင်လပ္လည် တန်နှင်လာနိယ် ။  ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၈ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2188587',
    startJdn: 2188587.5,
    title: {
      'en':
          'မဟာရစ်စေတီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၄၁ ခု စိဿ်နှစ် တပိုဝ်ဓွယ်လ္ဆန် ၁၀ ရျက် ၄ နိယ် တက်နိယ် ၃၆ ဖ္လွါလျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇ (ခ)။',
      'my':
          'မဟာရစ်စေတီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၄၁ ခု စိဿ်နှစ် တပိုဝ်ဓွယ်လ္ဆန် ၁၀ ရျက် ၄ နိယ် တက်နိယ် ၃၆ ဖ္လွါလျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2189058',
    startJdn: 2189058.5,
    title: {
      'en':
          'သူကြွယ် အစလပို့ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၄၃ ခု ဖတ္တ်နှစ် ခူဆုန်လဆန် ၆ ရျက် သုကြာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၅။',
      'my':
          'သူကြွယ် အစလပို့ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၄၃ ခု ဖတ္တ်နှစ် ခူဆုန်လဆန် ၆ ရျက် သုကြာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၅။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2189802',
    startJdn: 2189802.5,
    title: {
      'en':
          'သတင်းသည် အပယ်ငယ် ကျောက်စာ။  သကရစ် ၆၄၅ ခု အာသိန်နှစ် အဓိမတ် နံယုန်လဆန် ၁၂ ရျက် တနှင်ဂုနိုယ်နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၄ (က)။',
      'my':
          'သတင်းသည် အပယ်ငယ် ကျောက်စာ။  သကရစ် ၆၄၅ ခု အာသိန်နှစ် အဓိမတ် နံယုန်လဆန် ၁၂ ရျက် တနှင်ဂုနိုယ်နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၄ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2191567',
    startJdn: 2191567.5,
    title: {
      'en':
          'ငါဖွယ်သင်လင်မယား ကျောက်စာ။ သကရစ် ၆၅၀ ခု တန်ခူလဆန် ၅ ရျက် တနှင်လာနိယ် ... ။  မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၆၈ (က)။',
      'my':
          'ငါဖွယ်သင်လင်မယား ကျောက်စာ။ သကရစ် ၆၅၀ ခု တန်ခူလဆန် ၅ ရျက် တနှင်လာနိယ် ... ။  မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၆၈ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2192147',
    startJdn: 2192147.5,
    title: {
      'en':
          'မဟာရစ်စေတီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၅၁ ခု စယ်နှစ် သန္တူလ္ဆုတ် ၈ ရျက် ၁ နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇ (ခ)။',
      'my':
          'မဟာရစ်စေတီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၅၁ ခု စယ်နှစ် သန္တူလ္ဆုတ် ၈ ရျက် ၁ နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2193376',
    startJdn: 2193376.5,
    title: {
      'en': 'Athinkhaya, Yazathingyan, Thihathu appointed viceroys.',
      'my': 'Athinkhaya, Yazathingyan, Thihathu appointed viceroys.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2193607',
    startJdn: 2193607.5,
    title: {
      'en':
          'ပုထိုးနီမင်းနှင့်မင်းကျစွာကျောက်စာ။ သကရစ် ၆၅၅ ခု သရဝန်နှစ် တန်ဆောင်မှုန် (လ္ဆန်။ သာသနာ ၇ ရက်ကြာသပတိ...)၊ နေိယ်လျှင် ပုထိုင်နီမင်နှင်မင်က္လဟွာ မောင်နှံ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၁၀(က)။',
      'my':
          'ပုထိုးနီမင်းနှင့်မင်းကျစွာကျောက်စာ။ သကရစ် ၆၅၅ ခု သရဝန်နှစ် တန်ဆောင်မှုန် (လ္ဆန်။ သာသနာ ၇ ရက်ကြာသပတိ...)၊ နေိယ်လျှင် ပုထိုင်နီမင်နှင်မင်က္လဟွာ မောင်နှံ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၁၀(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2193915',
    startJdn: 2193915.5,
    title: {
      'en':
          'သ္ခိင်ကုနကမ္ဘီ ကျောက်စာ။ သကရစ် ၆၅၆ ခု ဘတ်နှစ် နံကာလ္ဆုတ် ၅ ရျက် ၅ နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၂ (ခ)။',
      'my':
          'သ္ခိင်ကုနကမ္ဘီ ကျောက်စာ။ သကရစ် ၆၅၆ ခု ဘတ်နှစ် နံကာလ္ဆုတ် ၅ ရျက် ၅ နိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၂ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2193998',
    startJdn: 2193998.5,
    title: {
      'en':
          'သူကြွယ် ငက္လုံသင် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၅၆ ခု ။ သရဝန်နှစ် (? possible year error)။ တန်ဆောင်မှုန်လပ္လည် ။ ပုတ္တ (ဟူနိ)ယ် ။ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၈။',
      'my':
          'သူကြွယ် ငက္လုံသင် ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၅၆ ခု ။ သရဝန်နှစ် (? possible year error)။ တန်ဆောင်မှုန်လပ္လည် ။ ပုတ္တ (ဟူနိ)ယ် ။ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၆၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2194673',
    startJdn: 2194673.5,
    title: {
      'en':
          'မ္လတ်ကြီးစွာ သိမ်ကျောင်း ကျောက်စာ။ ရာဇသင်ကြံ၊ သံပျင်သိင်္ကသူ။ လှူဒါန်း။ သကရစ် ၆၅၈ သန္တု လ္ဆန် ၁၄ ရျက် (၁ နိယ်) နှိုက် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၀။',
      'my':
          'မ္လတ်ကြီးစွာ သိမ်ကျောင်း ကျောက်စာ။ ရာဇသင်ကြံ၊ သံပျင်သိင်္ကသူ။ လှူဒါန်း။ သကရစ် ၆၅၈ သန္တု လ္ဆန် ၁၄ ရျက် (၁ နိယ်) နှိုက် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2194743',
    startJdn: 2194743.5,
    title: {
      'en':
          'သီဟသူရမင်းကြီးကျောက်စာ။ သီဟသူကုလားကျောင်း၊ ကျောင်းဝင်းအတွင်း၊ မြင်စိုင်းမြို့။ လှူဒါန်း။ သကရစ် ၆၅၈ ခု ကြတိုက်နှစ် နတ္တ်လ္ဆုတ် ၇ ရျက် ၀နေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၄။',
      'my':
          'သီဟသူရမင်းကြီးကျောက်စာ။ သီဟသူကုလားကျောင်း၊ ကျောင်းဝင်းအတွင်း၊ မြင်စိုင်းမြို့။ လှူဒါန်း။ သကရစ် ၆၅၈ ခု ကြတိုက်နှစ် နတ္တ်လ္ဆုတ် ၇ ရျက် ၀နေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၄။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2195091',
    startJdn: 2195091.5,
    title: {
      'en':
          'မ္လတ်ကြီးစွာ သိမ်ကျောင်း ကျောက်စာ။ ရာဇသင်ကြံ၊ သံပျင်သိင်္ကသူ။ လှူဒါန်း။ သကရစ် ၆၅၉ ခု တန်ဆောင်မှုန်လ္ဆန် ၁၅ ရျက် ၅ နိယ်နှိုက္က်ာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၀။',
      'my':
          'မ္လတ်ကြီးစွာ သိမ်ကျောင်း ကျောက်စာ။ ရာဇသင်ကြံ၊ သံပျင်သိင်္ကသူ။ လှူဒါန်း။ သကရစ် ၆၅၉ ခု တန်ဆောင်မှုန်လ္ဆန် ၁၅ ရျက် ၅ နိယ်နှိုက္က်ာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2195147',
    startJdn: 2195147.5,
    title: {
      'en':
          'မင်းမတ် သတျာပိစည်း ကျောက်စာ။ လှူဒါန်း။ သက်ရစ် ၆၅၉ ခု မြိုက္က်သိုဝ်နှစ် ပ္လသိုဝ်လ္ဆန် ၁၃ ရျက် ၅ နိယ်လျှင် နန်က္လမင် ကွန်ပြောက်ကြီ ထွက်တဝ်မူသော မင်မတ် သတျာပိစည် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၁ (က)။',
      'my':
          'မင်းမတ် သတျာပိစည်း ကျောက်စာ။ လှူဒါန်း။ သက်ရစ် ၆၅၉ ခု မြိုက္က်သိုဝ်နှစ် ပ္လသိုဝ်လ္ဆန် ၁၃ ရျက် ၅ နိယ်လျှင် နန်က္လမင် ကွန်ပြောက်ကြီ ထွက်တဝ်မူသော မင်မတ် သတျာပိစည် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၁ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2195169',
    startJdn: 2195169.5,
    title: {
      'en':
          'သိမ်ကျောင်း စေတီအား မြေလှူသော ကျောက်စာ။ သကရစ် ၆၅၉ ခု မြိုက္ကသိုဝ်နှစ် တပိုဝ်ထွယ်လ္ဆန်း ၃ ရျက် သူကြာနိယ် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၅။',
      'my':
          'သိမ်ကျောင်း စေတီအား မြေလှူသော ကျောက်စာ။ သကရစ် ၆၅၉ ခု မြိုက္ကသိုဝ်နှစ် တပိုဝ်ထွယ်လ္ဆန်း ၃ ရျက် သူကြာနိယ် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၅။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2195183',
    startJdn: 2195183.5,
    title: {
      'en':
          'သံပျင် သတျာပတေ့ကျောင်း ကျောက်စာ။ သံပျင် သတျာပတေ့။ လှူဒါန်း။ သကရစ် ၆၅၉ ခု မြိက်ကသိုလ်နှစ် တပိုဝ်ထွယ်လ္ဆုတ် ၄ ရျက် သုကြာနိယ် ပန်ပွတ်ရပ်စေတီ မ္လစ်နှိုက် သံပျင် သတျာပတိယ် ကုလာက္လောင်ပြသတ် စလစ်ဥိထွက် ပ္လု၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃၆။',
      'my':
          'သံပျင် သတျာပတေ့ကျောင်း ကျောက်စာ။ သံပျင် သတျာပတေ့။ လှူဒါန်း။ သကရစ် ၆၅၉ ခု မြိက်ကသိုလ်နှစ် တပိုဝ်ထွယ်လ္ဆုတ် ၄ ရျက် သုကြာနိယ် ပန်ပွတ်ရပ်စေတီ မ္လစ်နှိုက် သံပျင် သတျာပတိယ် ကုလာက္လောင်ပြသတ် စလစ်ဥိထွက် ပ္လု၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၃၆။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2195620',
    startJdn: 2195620.5,
    title: {
      'en':
          'မိသင်၏သား ငါတပါညီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၆၁ မာခနှစ် ခုဆုန် လဆန် ဆယ်ရျက် တနှင်လာနိယ္အ်၊ မိသင် သာ ငါတပါ ငီ ပေါက်တိုဝ်ရပ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၃။',
      'my':
          'မိသင်၏သား ငါတပါညီ ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၆၆၁ မာခနှစ် ခုဆုန် လဆန် ဆယ်ရျက် တနှင်လာနိယ္အ်၊ မိသင် သာ ငါတပါ ငီ ပေါက်တိုဝ်ရပ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2195648',
    startJdn: 2195648.5,
    title: {
      'en':
          'မ္လတ်ကြီးစွာ သိမ်ကျောင်း ကျောက်စာ။ ရာဇသင်ကြံ၊ သံပျင်သိင်္ကသူ။ လှူဒါန်း။ သကရစ် ၆61 ခု နံမျုန်လ္ဆန် ၁၂ ရျက် ၂ နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၀။',
      'my':
          'မ္လတ်ကြီးစွာ သိမ်ကျောင်း ကျောက်စာ။ ရာဇသင်ကြံ၊ သံပျင်သိင်္ကသူ။ လှူဒါန်း။ သကရစ် ၆61 ခု နံမျုန်လ္ဆန် ၁၂ ရျက် ၂ နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2196712',
    startJdn: 2196712.5,
    title: {
      'en':
          'ရွှေနန်းသျှင်ကျောင်း ကျောက်စာ။  သက္ကရစ် ၆၆၄ ခု ဖုဿနှစ် (should be ပိသျက်?) ကဆုန် လ္ဆန် ၁၃ ရျက် ၂ နိယ် ရှုဲနန်သျင် လှူသော ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၅။',
      'my':
          'ရွှေနန်းသျှင်ကျောင်း ကျောက်စာ။  သက္ကရစ် ၆၆၄ ခု ဖုဿနှစ် (should be ပိသျက်?) ကဆုန် လ္ဆန် ၁၃ ရျက် ၂ နိယ် ရှုဲနန်သျင် လှူသော ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၅။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2197332',
    startJdn: 2197332.5,
    title: {
      'en':
          'အသင်္ခယာကျောင်း ကျောက်စာ။  သက္ကရစ် ၆၆၅ ခု စိဿနှစ် ပ္လတ်သိုဝ်လ္ဆန် ၁၂ ရျက် သောက်ကြာနေလျှင် သာသနာ ၅၀၀၀ လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၆ (က)။',
      'my':
          'အသင်္ခယာကျောင်း ကျောက်စာ။  သက္ကရစ် ၆၆၅ ခု စိဿနှစ် ပ္လတ်သိုဝ်လ္ဆန် ၁၂ ရျက် သောက်ကြာနေလျှင် သာသနာ ၅၀၀၀ လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၆ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2199000',
    startJdn: 2199000.5,
    title: {
      'en':
          'မင်းမတ်ကြီး သုံးယောက်နှမ ကျောက်စာ။ သကရစ် ၆၇၀ ကြာတိုက်နှစ် မ္လွယ်တာလ္ဆုတ် ၁၀ ရျက် ၊ တနှင်ကနှုယ်နိယ်အာ ၊ မင်မတ်ကြီ သုံယောက်နှမ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၆။',
      'my':
          'မင်းမတ်ကြီး သုံးယောက်နှမ ကျောက်စာ။ သကရစ် ၆၇၀ ကြာတိုက်နှစ် မ္လွယ်တာလ္ဆုတ် ၁၀ ရျက် ၊ တနှင်ကနှုယ်နိယ်အာ ၊ မင်မတ်ကြီ သုံယောက်နှမ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၆။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2198820',
    startJdn: 2198820.5,
    title: {
      'en':
          'လှည်းငှူးနှင့် အမတ်ကြီး ရာဇာသင်ကြံတို့ ကျောက်စာ။ သကရစ် ၆၆၉ ခုအာသိန်နှစ် တပိုဝ်ထွယ် လ္ဆုတ် ၉ ရျက် အင်ကာနိယ် လှည်ငှူသ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၇။',
      'my':
          'လှည်းငှူးနှင့် အမတ်ကြီး ရာဇာသင်ကြံတို့ ကျောက်စာ။ သကရစ် ၆၆၉ ခုအာသိန်နှစ် တပိုဝ်ထွယ် လ္ဆုတ် ၉ ရျက် အင်ကာနိယ် လှည်ငှူသ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2199305',
    startJdn: 2199305.5,
    title: {
      'en':
          'ရတနာစေတီ ကျောက်စာ။ သကရစ် ၆၇၁ ခု မြက္ကသိုဝ်နှစ် နံယုန် လ္ဆန် ၅ ရျက် ကြာသပတိယ် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၃ (က)။',
      'my':
          'ရတနာစေတီ ကျောက်စာ။ သကရစ် ၆၇၁ ခု မြက္ကသိုဝ်နှစ် နံယုန် လ္ဆန် ၅ ရျက် ကြာသပတိယ် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၃ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2200631',
    startJdn: 2200631.5,
    title: {
      'en':
          'အဘယတေ တောကျောင်း မြတ်ကြီးစေတီ ကျောက်စာ။ သကရစ် ၆၇၄ ခု ဖ္လကိုန်နှစ် တပိုဝ်ထွယ် လ္ဆန် ၃ ရက် ၁ နိယ်လျှင် သ္ခိင် အဘယထေ တဝ်က္လောင် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၁။',
      'my':
          'အဘယတေ တောကျောင်း မြတ်ကြီးစေတီ ကျောက်စာ။ သကရစ် ၆၇၄ ခု ဖ္လကိုန်နှစ် တပိုဝ်ထွယ် လ္ဆန် ၃ ရက် ၁ နိယ်လျှင် သ္ခိင် အဘယထေ တဝ်က္လောင် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၁။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2200669',
    startJdn: 2200669.5,
    title: {'en': 'Foundation of Pinya.', 'my': 'Foundation of Pinya.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2200986',
    startJdn: 2200986.5,
    title: {
      'en':
          'ကိုရံသူကြီးကျောင်း ကျောက်စာ။ သကရစ်ကာ ၆၇၅ ခု စိဿနှစ် (*မှတ်ချက် - ၆၇၅ ဆိုပါက စယ်နှစ်ဖြစ်သင့်သည်) ပ္လသိုဝ်လဆန် ၄ ရျက် သုက်ကြာနိယ်ေတ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၀။',
      'my':
          'ကိုရံသူကြီးကျောင်း ကျောက်စာ။ သကရစ်ကာ ၆၇၅ ခု စိဿနှစ် (*မှတ်ချက် - ၆၇၅ ဆိုပါက စယ်နှစ်ဖြစ်သင့်သည်) ပ္လသိုဝ်လဆန် ၄ ရျက် သုက်ကြာနိယ်ေတ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၈၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2201496',
    startJdn: 2201496.5,
    title: {'en': 'Sagaing Kingdom founded.', 'my': 'Sagaing Kingdom founded.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2203117',
    startJdn: 2203117.5,
    title: {
      'en':
          'မြင်စိုင်းကျောင်း ကျောက်စာ။  သက္ကရစ် ၆၈၁ ခု အာသိန်နှစ် တန်ဆောင်မုန်လ္ဆန် ၉ ရျက် ၂ နိယ်  သာသနာ ၅၀၀၀ တည်စိမ်သောငှာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၆ (ခ)။',
      'my':
          'မြင်စိုင်းကျောင်း ကျောက်စာ။  သက္ကရစ် ၆၈၁ ခု အာသိန်နှစ် တန်ဆောင်မုန်လ္ဆန် ၉ ရျက် ၂ နိယ်  သာသနာ ၅၀၀၀ တည်စိမ်သောငှာ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၆ (ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2204941',
    startJdn: 2204941.5,
    title: {
      'en':
          'ကန်စွက်ကျောင်း ကျောက်စာ။ သကရစ် ၆၈၆ ခု ဓိမှတိနှစ် တန်ဆောင်မှုန်။ လ္ဆန် သာသနာ ၂ ရျက် ၆ နိယ် တောင်ပနှိုက်။ တောင်ပမင် စေတီ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၄။',
      'my':
          'ကန်စွက်ကျောင်း ကျောက်စာ။ သကရစ် ၆၈၆ ခု ဓိမှတိနှစ် တန်ဆောင်မှုန်။ လ္ဆန် သာသနာ ၂ ရျက် ၆ နိယ် တောင်ပနှိုက်။ တောင်ပမင် စေတီ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၄။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2205535',
    startJdn: 2205535.5,
    title: {
      'en':
          'ရာဇသင်ကြံ မျောက်သား ကျောက်စာ။ သက္စြ် ၆၈၈ ၊ နွယ်တာလ္ဆန် ၆ ၊ ၅ ၊ စစ်သူကြီ ရယ်စစင်ကြံ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၆။',
      'my':
          'ရာဇသင်ကြံ မျောက်သား ကျောက်စာ။ သက္စြ် ၆၈၈ ၊ နွယ်တာလ္ဆန် ၆ ၊ ၅ ၊ စစ်သူကြီ ရယ်စစင်ကြံ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၆။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2206515',
    startJdn: 2206515.5,
    title: {
      'en':
          'သရအိုင် သာရီရိက စေတီတော် ကျောက်စာ။ ကရစ် ၆၉၀ အာသတ်(နှစ်) တပေါင် .န် ၁၀ ရျက် ၅ နိယ်လျှင် ဖုန်မ္တတ်ကြိစွာ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၇။',
      'my':
          'သရအိုင် သာရီရိက စေတီတော် ကျောက်စာ။ ကရစ် ၆၉၀ အာသတ်(နှစ်) တပေါင် .န် ၁၀ ရျက် ၅ နိယ်လျှင် ဖုန်မ္တတ်ကြိစွာ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2207887',
    startJdn: 2207887.5,
    title: {
      'en':
          'မင်းမတ် အထင်္ကပိစည်းကျောင်း ကျောက်စာ။ သက္ကရစ် ၆၉၄ ခု ကြတိုက်နှစ် တန်ဆောင်မှုန်လ္ဆုတ် ၉ ရျက် ၅ နေအာ မင်မတ်ထင်္ကပိစည်ကာ  ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၈ (က)။',
      'my':
          'မင်းမတ် အထင်္ကပိစည်းကျောင်း ကျောက်စာ။ သက္ကရစ် ၆၉၄ ခု ကြတိုက်နှစ် တန်ဆောင်မှုန်လ္ဆုတ် ၉ ရျက် ၅ နေအာ မင်မတ်ထင်္ကပိစည်ကာ  ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၉၈ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2209053',
    startJdn: 2209053.5,
    title: {
      'en':
          'မထောစေတီ ကျောက်စာ။  သကရစ် ၆၉၇ ခု မာခနှစ် တပိုဝ်ထလ္ဆန် ၇ ရျက် ၂ နိယ်အာ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၀၁။',
      'my':
          'မထောစေတီ ကျောက်စာ။  သကရစ် ၆၉၇ ခု မာခနှစ် တပိုဝ်ထလ္ဆန် ၇ ရျက် ၂ နိယ်အာ ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၀၁။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2209175',
    startJdn: 2209175.5,
    title: {
      'en':
          'တန်လိုင်သူကြီးဖုံမသင်ကြံကျောက်စာ။ သကရစ် ၆၉၈ စဲနှစ် နမျုန်လ္ဆန်၁၁ ၅နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၈။',
      'my':
          'တန်လိုင်သူကြီးဖုံမသင်ကြံကျောက်စာ။ သကရစ် ၆၉၈ စဲနှစ် နမျုန်လ္ဆန်၁၁ ၅နိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2209585',
    startJdn: 2209585.5,
    title: {
      'en':
          'သုံးပန်လှဘုရား ကျောက်စာ။  သကရစ် ၆၉၉ ခု စယ်နှစ် မ္လွယ်တာလ္ဆန် ဆဲရျက် တနှင်လာနေ ဖုံမ္မကြံ မောင်နှံ ကောင်မှုပ္လုရုယ် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၁၃။',
      'my':
          'သုံးပန်လှဘုရား ကျောက်စာ။  သကရစ် ၆၉၉ ခု စယ်နှစ် မ္လွယ်တာလ္ဆန် ဆဲရျက် တနှင်လာနေ ဖုံမ္မကြံ မောင်နှံ ကောင်မှုပ္လုရုယ် ...  ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၁၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2214285',
    startJdn: 2214285.5,
    title: {
      'en':
          'သကရာဇ် ၇၁(၂) ပိဿျက်နှစ် နံယုန် လ လ္ဆုတ် တရျက် ကြသပတေနေ နေတက် ၇ ဖ္လွါလျှင် တေည်သတေ ... ။ အလှူရှင် -ငကြိသင်။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-ခ)။',
      'my':
          'သကရာဇ် ၇၁(၂) ပိဿျက်နှစ် နံယုန် လ လ္ဆုတ် တရျက် ကြသပတေနေ နေတက် ၇ ဖ္လွါလျှင် တေည်သတေ ... ။ အလှူရှင် -ငကြိသင်။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2215073',
    startJdn: 2215073.5,
    title: {
      'en':
          'သကရစ် ၇၁၄ ခု၊ အသတ်နှစ် နံကာလဆန် ၄ ရျက် တန်နှင်လာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၇၉။',
      'my':
          'သကရစ် ၇၁၄ ခု၊ အသတ်နှစ် နံကာလဆန် ၄ ရျက် တန်နှင်လာနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၇၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2215292',
    startJdn: 2215292.5,
    title: {
      'en':
          'မိတ္ထိလာလင်စင်းကန်ရိုးယှိ ကျောက်စာ။ သကရစ် ၇၁၄ ခု အာသတ်နှစ် တပေါင်လ္ဆုတ် ၃ ရျက် ပုတ္တဟူနိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၆၉။',
      'my':
          'မိတ္ထိလာလင်စင်းကန်ရိုးယှိ ကျောက်စာ။ သကရစ် ၇၁၄ ခု အာသတ်နှစ် တပေါင်လ္ဆုတ် ၃ ရျက် ပုတ္တဟူနိယ်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၆၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2216434',
    startJdn: 2216434.5,
    title: {
      'en':
          'မင်းနန်သူကျောင်းကျောက်စာ။ ...ရစ် ၇၁၈ ခု ကြတိုက်နှစ် ကဆုန်လ္ဆန် ၈ ရျက် (၅နေအား) ရတနာသုံမ်ပါ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၂၆ (က)။',
      'my':
          'မင်းနန်သူကျောင်းကျောက်စာ။ ...ရစ် ၇၁၈ ခု ကြတိုက်နှစ် ကဆုန်လ္ဆန် ၈ ရျက် (၅နေအား) ရတနာသုံမ်ပါ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၂၆ (က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2216756',
    startJdn: 2216756.5,
    title: {
      'en':
          'မာရဖင်ရတနာ စည်းခုံဘုရားကျောံစာ။ သကရစ် ၇၁၈ ခု တပေါင်လ္ဆန် ၅ ရျက် ၂လာနေလျှင် ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၉၃။',
      'my':
          'မာရဖင်ရတနာ စည်းခုံဘုရားကျောံစာ။ သကရစ် ၇၁၈ ခု တပေါင်လ္ဆန် ၅ ရျက် ၂လာနေလျှင် ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၉၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2216924',
    startJdn: 2216924.5,
    title: {
      'en':
          'တလုပ်မြို့သက်တော်ရဘုရားကျောက်စာ။သကြစ် ၇၁၉ ခုမြိုင်က္ကသိုဝ်နှစ်ဝါခေါင်လဆုတ်၈ရက် ၅ နေိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၃၀။',
      'my':
          'တလုပ်မြို့သက်တော်ရဘုရားကျောက်စာ။သကြစ် ၇၁၉ ခုမြိုင်က္ကသိုဝ်နှစ်ဝါခေါင်လဆုတ်၈ရက် ၅ နေိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၃၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2218441',
    startJdn: 2218441.5,
    title: {
      'en':
          'ရွှေစည်းခုံဘုရားကျောက်စာ။ သကရစ် ၇၂၃ ခု စယ်နှစ် တံဆောင်မုန်လ္ဆန် ၇ ရျက် ၃ နိယ် နက္ခ်တ် ၂၆ ခုပြိစ္ဆာလက်လျှင် ရွာ . တည်၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၁၈။',
      'my':
          'ရွှေစည်းခုံဘုရားကျောက်စာ။ သကရစ် ၇၂၃ ခု စယ်နှစ် တံဆောင်မုန်လ္ဆန် ၇ ရျက် ၃ နိယ် နက္ခ်တ် ၂၆ ခုပြိစ္ဆာလက်လျှင် ရွာ . တည်၏ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၁၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2218961',
    startJdn: 2218961.5,
    title: {
      'en':
          'အမတ်ကြီးသရေအသင်္ခယာ ကျောက်စာ။ သကရစ် ၇၂၄ ခု ပိဿျက်နှစ်တပေါင်းလ္ဆန် ၁၀ရျက်၁နွေနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၃၈(က)။',
      'my':
          'အမတ်ကြီးသရေအသင်္ခယာ ကျောက်စာ။ သကရစ် ၇၂၄ ခု ပိဿျက်နှစ်တပေါင်းလ္ဆန် ၁၀ရျက်၁နွေနိယ် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၃၈(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2219652',
    startJdn: 2219652.5,
    title: {'en': 'Foundation of Inwa.', 'my': 'Foundation of Inwa.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2220369',
    startJdn: 2220369.5,
    title: {
      'en':
          'မိတ္တရ သိန်းစည်း အမတ်ကြီး ကျောက်စာ၊ မိတ္တရ သိန်းစည်း အမတ်ကြီး၊ မိဖုရားစောဥမ္မဒန္တီ စန္တသူအမတ်ကြီး။ ကျောင်း၊ မြေ၊ လယ် လှူဒါန်း။ ... သကရစ် ၇၂၇ ခု တပိုဝ်ထွယ်လပ္လည် သောက်ကြာနေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၈။ (Year should be 728 if it is friday. 7 and 8 error is common.)',
      'my':
          'မိတ္တရ သိန်းစည်း အမတ်ကြီး ကျောက်စာ၊ မိတ္တရ သိန်းစည်း အမတ်ကြီး၊ မိဖုရားစောဥမ္မဒန္တီ စန္တသူအမတ်ကြီး။ ကျောင်း၊ မြေ၊ လယ် လှူဒါန်း။ ... သကရစ် ၇၂၇ ခု တပိုဝ်ထွယ်လပ္လည် သောက်ကြာနေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၁။ ကျောက်တိုင်အမှတ် နံပါတ် ၁၈။ (Year should be 728 if it is friday. 7 and 8 error is common.)',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2220747',
    startJdn: 2220747.5,
    title: {'en': 'Razadarit’s DOB.', 'my': 'Razadarit’s DOB.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2222556',
    startJdn: 2222556.5,
    title: {
      'en':
          'သကရာဇ် ၇၃၄ ခု ဖ္လကိုန်နှစ် တပိုဝ်ထွယ် လပ္လည် တနှင်လာ နံနက်စေတီသည်သတေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-က)။',
      'my':
          'သကရာဇ် ၇၃၄ ခု ဖ္လကိုန်နှစ် တပိုဝ်ထွယ် လပ္လည် တနှင်လာ နံနက်စေတီသည်သတေ ... ။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2223369',
    startJdn: 2223369.5,
    title: {
      'en':
          'သက္ကရာဇ် ၇၃၇ ခု ကဆုန်လဆန် ၆ ရျက် အင်္ကာနေလျင် ... ။ အလှူရှင် -ငကြိသင်။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-ခ)။',
      'my':
          'သက္ကရာဇ် ၇၃၇ ခု ကဆုန်လဆန် ၆ ရျက် အင်္ကာနေလျင် ... ။ အလှူရှင် -ငကြိသင်။ မန္တလေးနန်းတွင်းကျောက်စာများ အတွဲ ၂။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံ (၁) အတွင်း။ ကျောက်တိုင်အမှတ် နံပါတ် (၇၈-ခ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2226567',
    startJdn: 2226567.5,
    title: {
      'en': 'Razadarit comes to power.',
      'my': 'Razadarit comes to power.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2228075',
    startJdn: 2228075.5,
    title: {
      'en':
          'သူကြီး ကျောက်စာ။ နမောတဿတိ၊ သက္ကရာဇ် ၇၄၉ ခု၊ ပြိဿနှစ် တပေါင် လ္ဆန် တဆယ် ၄ ရျက်၊ ကြာသပတေနိယ်အာ၊ မြမ္မာပြည် အကြေအညာ  ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၄၉။',
      'my':
          'သူကြီး ကျောက်စာ။ နမောတဿတိ၊ သက္ကရာဇ် ၇၄၉ ခု၊ ပြိဿနှစ် တပေါင် လ္ဆန် တဆယ် ၄ ရျက်၊ ကြာသပတေနိယ်အာ၊ မြမ္မာပြည် အကြေအညာ  ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၇၄၉။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2230727',
    startJdn: 2230727.5,
    title: {
      'en':
          'ပုခြည်သူကြီး ကျောက်စာ။ ... ရစ် ၇၅၇၊ နယုန်လ္ဆန် ၈ ရျက် ၄ နေ ပုခြည်သူကြီ... ။  မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၇၀။',
      'my':
          'ပုခြည်သူကြီး ကျောက်စာ။ ... ရစ် ၇၅၇၊ နယုန်လ္ဆန် ၈ ရျက် ၄ နေ ပုခြည်သူကြီ... ။  မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့၊ နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၇၀။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2231097',
    startJdn: 2231097.5,
    title: {
      'en':
          'မာရဖင်ရတနာ စည်းခုံဘုရားကျောံစာ။ သက္ကရစ် ၇၅၈ ခု နံမျုန် လ္ဆုတ် ၉ ရျက် ပုတ်တဟူနေလျှင် ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၉၃။',
      'my':
          'မာရဖင်ရတနာ စည်းခုံဘုရားကျောံစာ။ သက္ကရစ် ၇၅၈ ခု နံမျုန် လ္ဆုတ် ၉ ရျက် ပုတ်တဟူနေလျှင် ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၉၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2233185',
    startJdn: 2233185.5,
    title: {
      'en':
          'ပျူကန်မင်းမတ်သရေလင်မယားကျောင်းကျောံစာ။ ... ၇၆၃ ခု၊ အာသိုတ်နှစ် (နှစ်အမည်သရဝန်နှစ်ဖြစ်မှကိုက်ညီမည်) တပေါင်လပ္လည် ကြာ ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇၈။',
      'my':
          'ပျူကန်မင်းမတ်သရေလင်မယားကျောင်းကျောံစာ။ ... ၇၆၃ ခု၊ အာသိုတ်နှစ် (နှစ်အမည်သရဝန်နှစ်ဖြစ်မှကိုက်ညီမည်) တပေါင်လပ္လည် ကြာ ...။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇၈။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2234932',
    startJdn: 2234932.5,
    title: {
      'en': 'Minye Kyawswa takes Launggyet.',
      'my': 'Minye Kyawswa takes Launggyet.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2237958',
    startJdn: 2237958.5,
    title: {'en': 'Minye Kyawswa dies.', 'my': 'Minye Kyawswa dies.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2239232',
    startJdn: 2239232.5,
    title: {
      'en':
          'တန်ဆောင်းကျောင်း ကျောက်စာ။ သက္ကရစ် ၇၈၀ ဝါကျွတ်လဆန် ၁၀ ရက် ပိတဟူနေနှိုက် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၅(မျက်နှာ)။',
      'my':
          'တန်ဆောင်းကျောင်း ကျောက်စာ။ သက္ကရစ် ၇၈၀ ဝါကျွတ်လဆန် ၁၀ ရက် ပိတဟူနေနှိုက် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၅(မျက်နှာ)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2239373',
    startJdn: 2239373.5,
    title: {
      'en':
          'ယောက်ခမတော်ကျောင်းကျောက်စာ။ သက္ကရဇ် ၇၈၀ မာခနှစ် တပေါင်လဆန်တရက် ကြာသပဒေနေနှိုက်၊ မ္လိယ်သျှင်နှစ်ပါ စကာမျာကြသည် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၅(ကျော)။',
      'my':
          'ယောက်ခမတော်ကျောင်းကျောက်စာ။ သက္ကရဇ် ၇၈၀ မာခနှစ် တပေါင်လဆန်တရက် ကြာသပဒေနေနှိုက်၊ မ္လိယ်သျှင်နှစ်ပါ စကာမျာကြသည် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၀၅(ကျော)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2243108',
    startJdn: 2243108.5,
    title: {
      'en': 'Min Saw Mon becomes king.',
      'my': 'Min Saw Mon becomes king.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2243847',
    startJdn: 2243847.5,
    title: {
      'en':
          'စည်းခုံဘုရား ကျောက်စာ။ သက္ကရာဇ် ၇၉၃ ကဆုန်လပ္လည်သတင်သောက်ကြာနေိ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၃၅(က)။',
      'my':
          'စည်းခုံဘုရား ကျောက်စာ။ သက္ကရာဇ် ၇၉၃ ကဆုန်လပ္လည်သတင်သောက်ကြာနေိ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၃၅(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2244590',
    startJdn: 2244590.5,
    title: {'en': 'Min Saw Mon dies.', 'my': 'Min Saw Mon dies.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2245253',
    startJdn: 2245253.5,
    title: {
      'en':
          'ဘုရားထုရွာသူကြီး ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၇၉၇ ခု ၊ တန်ခုလဆန် ခုနှစ်ရက် ကြာသပတေနေ၊ ဖုရာထုရွာသူကြိ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၃၄(က)။',
      'my':
          'ဘုရားထုရွာသူကြီး ကျောက်စာ။ လှူဒါန်း။ သကရစ် ၇၉၇ ခု ၊ တန်ခုလဆန် ခုနှစ်ရက် ကြာသပတေနေ၊ ဖုရာထုရွာသူကြိ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၃၄(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2253758',
    startJdn: 2253758.5,
    title: {
      'en':
          'နရပတိမင်းကျောင်းကျောက်စာ။ သက္ကြစ် ၈၂၀။ ဝါဆိုလ္ဆန် ငါရက် ကြာသပတေနေညနေလွဲခုနစ်ခါနှိုက်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၅၈(က)။',
      'my':
          'နရပတိမင်းကျောင်းကျောက်စာ။ သက္ကြစ် ၈၂၀။ ဝါဆိုလ္ဆန် ငါရက် ကြာသပတေနေညနေလွဲခုနစ်ခါနှိုက်လျှင် ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၅၈(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2254065',
    startJdn: 2254065.5,
    title: {
      'en':
          'နရပတိမင်းကျောင်းကျောက်စာ။ သက္ကြစ် ၈၂၁။ ကဆုန် လ္ဆုတ် ၂ ရျက် ပုတ္တဟူနေ (နေတက်တပဟိုဝ်တွင်လျှင်) ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၅၈(က)။',
      'my':
          'နရပတိမင်းကျောင်းကျောက်စာ။ သက္ကြစ် ၈၂၁။ ကဆုန် လ္ဆုတ် ၂ ရျက် ပုတ္တဟူနေ (နေတက်တပဟိုဝ်တွင်လျှင်) ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၅၈(က)။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2257784',
    startJdn: 2257784.5,
    title: {
      'en':
          'စူဠာမုဏိဘုရား ကျောက်စာ။ ၈၃၁ ။ နွဲတာလပြည်၊ တနှင်လာ ရက်နှိုက်၊ နှစ်သိန်လေသောင်၊ အထုဟိသ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၅၇။',
      'my':
          'စူဠာမုဏိဘုရား ကျောက်စာ။ ၈၃၁ ။ နွဲတာလပြည်၊ တနှင်လာ ရက်နှိုက်၊ နှစ်သိန်လေသောင်၊ အထုဟိသ ... ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ (၂) ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၄၅၇။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2265960',
    startJdn: 2265960.5,
    title: {
      'en': 'Foundation of Dwarawaddy (Toungoo).',
      'my': 'Foundation of Dwarawaddy (Toungoo).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2269428',
    startJdn: 2269428.5,
    title: {
      'en': 'Coronation of Narapati II of Ava.',
      'my': 'Coronation of Narapati II of Ava.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2270840',
    startJdn: 2270840.5,
    title: {
      'en':
          'သက္ကရာဇ် ၈၆၇ တန်ခုလဆုတ် သုံရက် အင်ကာနေ၊ နက်သတ်သုံလုံ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇၃။',
      'my':
          'သက္ကရာဇ် ၈၆၇ တန်ခုလဆုတ် သုံရက် အင်ကာနေ၊ နက်သတ်သုံလုံ။ မန္တလေးနန်းတွင်းကျောက်စာရုံ(၂)ရှိကျောက်စာများ။ မန္တလေးမြို့နန်းတွင်းကျောက်စာရုံငယ်။ ကျောက်တိုင်အမှတ် နံပါတ် ၅၇၃။',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2272876',
    startJdn: 2272876.5,
    title: {
      'en': 'Mingyi Nyo declares independence from Ava.',
      'my': 'Mingyi Nyo declares independence from Ava.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2273003',
    startJdn: 2273003.5,
    title: {
      'en': 'Narapati II founds a new palace.',
      'my': 'Narapati II founds a new palace.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2278115',
    startJdn: 2278115.5,
    title: {
      'en': 'Ava falls to the Confederation (1st time).',
      'my': 'Ava falls to the Confederation (1st time).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2278866',
    startJdn: 2278866.5,
    title: {
      'en': 'Ava falls to the Confederation (2nd and final time).',
      'my': 'Ava falls to the Confederation (2nd and final time).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2280218',
    startJdn: 2280218.5,
    title: {
      'en': 'Tabinshwehti becomes king.',
      'my': 'Tabinshwehti becomes king.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2280402',
    startJdn: 2280402.5,
    title: {
      'en': 'Min Bin becomes king of Mrauk-U.',
      'my': 'Min Bin becomes king of Mrauk-U.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2280965',
    startJdn: 2280965.5,
    title: {'en': 'Min Bin takes Dhaka.', 'my': 'Min Bin takes Dhaka.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2281024',
    startJdn: 2281024.5,
    title: {
      'en': 'Min Bin celebrates victory over Bengal.',
      'my': 'Min Bin celebrates victory over Bengal.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2284411',
    startJdn: 2284411.5,
    title: {
      'en': 'Prome surrenders to Toungoo forces.',
      'my': 'Prome surrenders to Toungoo forces.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2284949',
    startJdn: 2284949.5,
    title: {
      'en': 'Confederation begins campaign to retake Prome.',
      'my': 'Confederation begins campaign to retake Prome.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2286039',
    startJdn: 2286039.5,
    title: {
      'en': 'Toungoo begins Arakan campaign.',
      'my': 'Toungoo begins Arakan campaign.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2286121',
    startJdn: 2286121.5,
    title: {
      'en': 'Toungoo forces capture Launggyet.',
      'my': 'Toungoo forces capture Launggyet.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2286128',
    startJdn: 2286128.5,
    title: {
      'en': 'Treaty of Mrauk-U signed.',
      'my': 'Treaty of Mrauk-U signed.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2286781',
    startJdn: 2286781.5,
    title: {'en': 'Siam campaign begins.', 'my': 'Siam campaign begins.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2286783',
    startJdn: 2286783.5,
    title: {
      'en': 'Burmese armies leave Kanchanaburi for Ayutthaya.',
      'my': 'Burmese armies leave Kanchanaburi for Ayutthaya.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2286889',
    startJdn: 2286889.5,
    title: {
      'en': 'Tabinshwehti gets back to Pegu.',
      'my': 'Tabinshwehti gets back to Pegu.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2287316',
    startJdn: 2287316.5,
    title: {
      'en': 'Tabinshwehti assassinated.',
      'my': 'Tabinshwehti assassinated.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2287524',
    startJdn: 2287524.5,
    title: {
      'en': 'Bayinnaung marches to Toungoo.',
      'my': 'Bayinnaung marches to Toungoo.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2287571',
    startJdn: 2287571.5,
    title: {
      'en': 'Bayinnaung takes Toungoo.',
      'my': 'Bayinnaung takes Toungoo.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2287802',
    startJdn: 2287802.5,
    title: {'en': 'Bayinnaung takes Prome.', 'my': 'Bayinnaung takes Prome.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2287997',
    startJdn: 2287997.5,
    title: {'en': 'Bayinnaung takes Pegu.', 'my': 'Bayinnaung takes Pegu.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2288668',
    startJdn: 2288668.5,
    title: {
      'en': 'Coronation of Bayinnaung and Atula Thiri at Pegu.',
      'my': 'Coronation of Bayinnaung and Atula Thiri at Pegu.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289043',
    startJdn: 2289043.5,
    title: {'en': 'Bayinnaung takes Ava.', 'my': 'Bayinnaung takes Ava.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2289700',
    startJdn: 2289700.5,
    title: {
      'en': 'Bayinnaung prepares to invade cis-Salween Shan states.',
      'my': 'Bayinnaung prepares to invade cis-Salween Shan states.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289760',
    startJdn: 2289760.5,
    title: {
      'en': 'Bayinnaung begins campaign to Shan states.',
      'my': 'Bayinnaung begins campaign to Shan states.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289777',
    startJdn: 2289777.5,
    title: {
      'en': 'Bayinnaung conquers Mong Mit (Momeik) and Hsipaw (Thibaw).',
      'my': 'Bayinnaung conquers Mong Mit (Momeik) and Hsipaw (Thibaw).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289791',
    startJdn: 2289791.5,
    title: {
      'en': 'Bayinnaung dedicates a pagoda each at Mong Mit and at Hsipaw.',
      'my': 'Bayinnaung dedicates a pagoda each at Mong Mit and at Hsipaw.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289831',
    startJdn: 2289831.5,
    title: {
      'en': 'Bayinnaung conquers Mong Yang (Mohnyin).',
      'my': 'Bayinnaung conquers Mong Yang (Mohnyin).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289837',
    startJdn: 2289837.5,
    title: {
      'en': 'Bayinnaung conquers Mong Kawng (Mogaung).',
      'my': 'Bayinnaung conquers Mong Kawng (Mogaung).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289851',
    startJdn: 2289851.5,
    title: {
      'en': 'Bayinnaung leaves Mong Kawng (Mogaung).',
      'my': 'Bayinnaung leaves Mong Kawng (Mogaung).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2289895',
    startJdn: 2289895.5,
    title: {
      'en': 'Bayinnaung dedicates a bell at the Shwezigon Pagoda.',
      'my': 'Bayinnaung dedicates a bell at the Shwezigon Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290052',
    startJdn: 2290052.5,
    title: {
      'en': 'Bayinnaung begins campaign to Mong Nai (Mone).',
      'my': 'Bayinnaung begins campaign to Mong Nai (Mone).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290209',
    startJdn: 2290209.5,
    title: {
      'en': 'Bayinnaung takes Chiang Mai.',
      'my': 'Bayinnaung takes Chiang Mai.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290437',
    startJdn: 2290437.5,
    title: {
      'en': 'Thado Minsaw’s Army leaves for Chiang Mai.',
      'my': 'Thado Minsaw’s Army leaves for Chiang Mai.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290641',
    startJdn: 2290641.5,
    title: {
      'en': 'Groundbreaking ceremony for the Mahazedi Pagoda.',
      'my': 'Groundbreaking ceremony for the Mahazedi Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290798',
    startJdn: 2290798.5,
    title: {'en': 'Yaza Datu Kalaya born.', 'my': 'Yaza Datu Kalaya born.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2290801',
    startJdn: 2290801.5,
    title: {
      'en': 'Dedicates the relic chamber of the Mahazedi.',
      'my': 'Dedicates the relic chamber of the Mahazedi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290818',
    startJdn: 2290818.5,
    title: {
      'en': 'Binnya Dala begins Manipur campaign.',
      'my': 'Binnya Dala begins Manipur campaign.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2290995',
    startJdn: 2290995.5,
    title: {
      'en':
          'Binnya Dala arrives back at Pegu (after a successful Manipur campaign).',
      'my':
          'Binnya Dala arrives back at Pegu (after a successful Manipur campaign).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2291215',
    startJdn: 2291215.5,
    title: {
      'en': 'Umbrella (hti) raising ceremony at the Mahazedi.',
      'my': 'Umbrella (hti) raising ceremony at the Mahazedi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2291311',
    startJdn: 2291311.5,
    title: {
      'en': 'Birth of son Thingadatta.',
      'my': 'Birth of son Thingadatta.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2291744',
    startJdn: 2291744.5,
    title: {
      'en': 'Fortifies Tavoy (Dawei) – for the upcoming invasion of Siam.',
      'my': 'Fortifies Tavoy (Dawei) – for the upcoming invasion of Siam.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2291898',
    startJdn: 2291898.5,
    title: {'en': 'Keng Tung submits.', 'my': 'Keng Tung submits.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2291979',
    startJdn: 2291979.5,
    title: {
      'en': 'Campaign to Chinese Shan States begins.',
      'my': 'Campaign to Chinese Shan States begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2291985',
    startJdn: 2291985.5,
    title: {
      'en': 'Yaza Dewi raised to senior queen.',
      'my': 'Yaza Dewi raised to senior queen.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2292140',
    startJdn: 2292140.5,
    title: {
      'en': 'Sends an embassy to Siam, demanding tribute.',
      'my': 'Sends an embassy to Siam, demanding tribute.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2292248',
    startJdn: 2292248.5,
    title: {'en': 'Siam Campaign begins.', 'my': 'Siam Campaign begins.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2292346',
    startJdn: 2292346.5,
    title: {
      'en': 'Overruns Portuguese defenses at the Ayutthaya harbor.',
      'my': 'Overruns Portuguese defenses at the Ayutthaya harbor.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2292357',
    startJdn: 2292357.5,
    title: {'en': 'Siam surrenders.', 'my': 'Siam surrenders.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2292604',
    startJdn: 2292604.5,
    title: {'en': 'Lan Na campaign begins.', 'my': 'Lan Na campaign begins.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2292774',
    startJdn: 2292774.5,
    title: {
      'en': 'Leaves Chiang Mai for Pegu.',
      'my': 'Leaves Chiang Mai for Pegu.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2292802',
    startJdn: 2292802.5,
    title: {'en': 'Arrives back at Pegu.', 'my': 'Arrives back at Pegu.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2292872',
    startJdn: 2292872.5,
    title: {
      'en': 'Begins work at the Shwemawdaw Pagoda.',
      'my': 'Begins work at the Shwemawdaw Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2292952',
    startJdn: 2292952.5,
    title: {
      'en': 'Returning troops from Lan Xang arrives back at Pegu.',
      'my': 'Returning troops from Lan Xang arrives back at Pegu.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2292979',
    startJdn: 2292979.5,
    title: {
      'en': 'Reconstruction of Pegu begins.',
      'my': 'Reconstruction of Pegu begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293078',
    startJdn: 2293078.5,
    title: {
      'en': 'Raises a new umbrella at the Shwedagon.',
      'my': 'Raises a new umbrella at the Shwedagon.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293092',
    startJdn: 2293092.5,
    title: {
      'en': 'Raises a new umbrella at the Mahazedi (Pegu).',
      'my': 'Raises a new umbrella at the Mahazedi (Pegu).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293274',
    startJdn: 2293274.5,
    title: {
      'en': 'Dedicates 52 Buddha statues.',
      'my': 'Dedicates 52 Buddha statues.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293358',
    startJdn: 2293358.5,
    title: {
      'en': 'Dedicates the building housing the Pitakas at the Mahazedi.',
      'my': 'Dedicates the building housing the Pitakas at the Mahazedi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293371',
    startJdn: 2293371.5,
    title: {
      'en': 'Leads the groundbreaking ceremony for the new gates of Pegu.',
      'my': 'Leads the groundbreaking ceremony for the new gates of Pegu.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293546',
    startJdn: 2293546.5,
    title: {
      'en': ' Umbrella raising ceremony at the Shwemawdaw.',
      'my': ' Umbrella raising ceremony at the Shwemawdaw.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293603',
    startJdn: 2293603.5,
    title: {
      'en': 'Work on the king’s house inside the new Palace begins.',
      'my': 'Work on the king’s house inside the new Palace begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293844',
    startJdn: 2293844.5,
    title: {'en': 'Enters the new palace.', 'my': 'Enters the new palace.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2293904',
    startJdn: 2293904.5,
    title: {
      'en': 'Learns of Ayutthaya’s rebellion.',
      'my': 'Learns of Ayutthaya’s rebellion.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2293936',
    startJdn: 2293936.5,
    title: {'en': 'Queen Atula Thiri dies.', 'my': 'Queen Atula Thiri dies.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2294039',
    startJdn: 2294039.5,
    title: {
      'en': 'Campaign to Ayutthaya begins.',
      'my': 'Campaign to Ayutthaya begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2294240',
    startJdn: 2294240.5,
    title: {
      'en': 'Campaign to Ayutthaya begins.',
      'my': 'Campaign to Ayutthaya begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2294247',
    startJdn: 2294247.5,
    title: {
      'en': 'Armies leave to meet Lan Xang forces.',
      'my': 'Armies leave to meet Lan Xang forces.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2294261',
    startJdn: 2294261.5,
    title: {'en': 'Defeats Lan Xang forces.', 'my': 'Defeats Lan Xang forces.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2294349',
    startJdn: 2294349.5,
    title: {'en': 'Takes Ayutthaya.', 'my': 'Takes Ayutthaya.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2294392',
    startJdn: 2294392.5,
    title: {
      'en': 'Appoints Maha Thammarachathirat as king of Siam.',
      'my': 'Appoints Maha Thammarachathirat as king of Siam.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2294422',
    startJdn: 2294422.5,
    title: {
      'en': 'Lan Xang campaign begins.',
      'my': 'Lan Xang campaign begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2294686',
    startJdn: 2294686.5,
    title: {
      'en': 'King of Manipur presents his daughter.',
      'my': 'King of Manipur presents his daughter.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2294984',
    startJdn: 2294984.5,
    title: {
      'en': 'Marriage of Minye Thihathu II and Min Khin Saw.',
      'my': 'Marriage of Minye Thihathu II and Min Khin Saw.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295225',
    startJdn: 2295225.5,
    title: {
      'en': 'Donates to the treasure chamber of Kyaikko Pagoda.',
      'my': 'Donates to the treasure chamber of Kyaikko Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295441',
    startJdn: 2295441.5,
    title: {
      'en': 'Donates to the treasure chamber of Kyaikko Pagoda.',
      'my': 'Donates to the treasure chamber of Kyaikko Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295496',
    startJdn: 2295496.5,
    title: {
      'en': 'Raises new umbrella at the Shwe Dagon.',
      'my': 'Raises new umbrella at the Shwe Dagon.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295601',
    startJdn: 2295601.5,
    title: {
      'en': 'Thinga Dathat’s hair shaving ceremony.',
      'my': 'Thinga Dathat’s hair shaving ceremony.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295725',
    startJdn: 2295725.5,
    title: {
      'en': 'Donates a new Buddha statue.',
      'my': 'Donates a new Buddha statue.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295909',
    startJdn: 2295909.5,
    title: {'en': 'Donates a new pyathat.', 'my': 'Donates a new pyathat.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2295969',
    startJdn: 2295969.5,
    title: {
      'en': 'Donates a hall at the Mahazedi.',
      'my': 'Donates a hall at the Mahazedi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2295988',
    startJdn: 2295988.5,
    title: {
      'en': 'Nawrahta Minsaw weds Hsinbyshin Medaw.',
      'my': 'Nawrahta Minsaw weds Hsinbyshin Medaw.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2296006',
    startJdn: 2296006.5,
    title: {
      'en': 'Wedding day of several sons and daughters of the king.',
      'my': 'Wedding day of several sons and daughters of the king.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2296234',
    startJdn: 2296234.5,
    title: {'en': 'Mohnyin campaign begins.', 'my': 'Mohnyin campaign begins.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2296240',
    startJdn: 2296240.5,
    title: {
      'en': 'Lan Xang campaign begins.',
      'my': 'Lan Xang campaign begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2296510',
    startJdn: 2296510.5,
    title: {
      'en': 'Arrives back to Pegu (from Vientiane).',
      'my': 'Arrives back to Pegu (from Vientiane).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2296594',
    startJdn: 2296594.5,
    title: {
      'en': 'Campaign to Mohnyin begins.',
      'my': 'Campaign to Mohnyin begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2296878',
    startJdn: 2296878.5,
    title: {
      'en': 'A female white elephant arrives from Tavoy.',
      'my': 'A female white elephant arrives from Tavoy.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2296998',
    startJdn: 2296998.5,
    title: {
      'en': 'Makes donations to the Mahazedi Pagoda.',
      'my': 'Makes donations to the Mahazedi Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297050',
    startJdn: 2297050.5,
    title: {
      'en': 'Stays at the royal tent west of the Mahazedi.',
      'my': 'Stays at the royal tent west of the Mahazedi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297112',
    startJdn: 2297112.5,
    title: {
      'en': 'Shin Thissa marries Min Hpone Myat.',
      'my': 'Shin Thissa marries Min Hpone Myat.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297328',
    startJdn: 2297328.5,
    title: {
      'en': 'Fugitive Mogaung Sawbwa brought before the king.',
      'my': 'Fugitive Mogaung Sawbwa brought before the king.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297348',
    startJdn: 2297348.5,
    title: {
      'en': 'Thinga Dathta’s hair knotting ceremony.',
      'my': 'Thinga Dathta’s hair knotting ceremony.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297364',
    startJdn: 2297364.5,
    title: {
      'en': 'Donates a new zayat (hall).',
      'my': 'Donates a new zayat (hall).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297625',
    startJdn: 2297625.5,
    title: {
      'en': 'New pyathat built at Pegu.',
      'my': 'New pyathat built at Pegu.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297775',
    startJdn: 2297775.5,
    title: {
      'en': 'New umbrella raising ceremony at the Sandawshin at Toungoo.',
      'my': 'New umbrella raising ceremony at the Sandawshin at Toungoo.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297787',
    startJdn: 2297787.5,
    title: {
      'en': 'Receives news of death of Maha Dewi of Lan Na.',
      'my': 'Receives news of death of Maha Dewi of Lan Na.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297816',
    startJdn: 2297816.5,
    title: {
      'en': 'Nawrahta Minsaw appointed viceroy of Lan Na.',
      'my': 'Nawrahta Minsaw appointed viceroy of Lan Na.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297891',
    startJdn: 2297891.5,
    title: {
      'en': 'Donation ceremony at Mahazedi.',
      'my': 'Donation ceremony at Mahazedi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2297970',
    startJdn: 2297970.5,
    title: {
      'en': 'Nawrahta Minsaw’s coronation ceremony at Chiang Mai.',
      'my': 'Nawrahta Minsaw’s coronation ceremony at Chiang Mai.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2298260',
    startJdn: 2298260.5,
    title: {
      'en':
          'Bayinnaung dedicates the treasure chamber of Kaung-mhu-daw Mahamuni Pagoda.',
      'my':
          'Bayinnaung dedicates the treasure chamber of Kaung-mhu-daw Mahamuni Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2298543',
    startJdn: 2298543.5,
    title: {
      'en': 'Umbrella (hti) raising ceremony at a pagoda.',
      'my': 'Umbrella (hti) raising ceremony at a pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2298548',
    startJdn: 2298548.5,
    title: {'en': 'City of Kale fortified.', 'my': 'City of Kale fortified.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2298557',
    startJdn: 2298557.5,
    title: {
      'en': 'Shin Thissa appointed governor of Nyaungyan.',
      'my': 'Shin Thissa appointed governor of Nyaungyan.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2298642',
    startJdn: 2298642.5,
    title: {'en': 'Receives Mohnyin Sawbwa.', 'my': 'Receives Mohnyin Sawbwa.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2298645',
    startJdn: 2298645.5,
    title: {
      'en': 'Receives Chaing Rai Sawbwa.',
      'my': 'Receives Chaing Rai Sawbwa.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2298664',
    startJdn: 2298664.5,
    title: {
      'en': 'Appoints Thinga Dathta viceroy of Martaban.',
      'my': 'Appoints Thinga Dathta viceroy of Martaban.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2298801',
    startJdn: 2298801.5,
    title: {'en': 'Bayinnaung dies.', 'my': 'Bayinnaung dies.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2299305',
    startJdn: 2299305.5,
    title: {
      'en': 'A comet going across the Sun observed.',
      'my': 'A comet going across the Sun observed.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2299718',
    startJdn: 2299718.5,
    title: {'en': 'Nanda marches to Ava.', 'my': 'Nanda marches to Ava.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2300003',
    startJdn: 2300003.5,
    title: {
      'en': 'Nanda dedicates a Bronze Buddha statue.',
      'my': 'Nanda dedicates a Bronze Buddha statue.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2300030',
    startJdn: 2300030.5,
    title: {
      'en':
          'Nanda dedicates five Buddha statues (hence known as Nga-Zu-Dayaka Min).',
      'my':
          'Nanda dedicates five Buddha statues (hence known as Nga-Zu-Dayaka Min).',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2300626',
    startJdn: 2300626.5,
    title: {'en': 'Siam campaign begins.', 'my': 'Siam campaign begins.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2301198',
    startJdn: 2301198.5,
    title: {
      'en': 'Marriage between Minye Kyawhtin and Princess Thakin Gyi.',
      'my': 'Marriage between Minye Kyawhtin and Princess Thakin Gyi.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2301477',
    startJdn: 2301477.5,
    title: {
      'en': 'Appoints Thado Dhamma Yaza III viceroy of Prome.',
      'my': 'Appoints Thado Dhamma Yaza III viceroy of Prome.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2302834',
    startJdn: 2302834.5,
    title: {
      'en': '5th invasion of Siam begins.',
      'my': '5th invasion of Siam begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2302899',
    startJdn: 2302899.5,
    title: {
      'en': 'Mingyi Swa dies in action.',
      'my': 'Mingyi Swa dies in action.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2303254',
    startJdn: 2303254.5,
    title: {
      'en': 'Appoints Minye Kyawswa II of Ava heir-apparent.',
      'my': 'Appoints Minye Kyawswa II of Ava heir-apparent.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2303254',
    startJdn: 2303254.5,
    title: {
      'en': 'Palace struck by lightning.',
      'my': 'Palace struck by lightning.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2304111',
    startJdn: 2304111.5,
    title: {'en': 'Queen Min Phyu dies.', 'my': 'Queen Min Phyu dies.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2304545',
    startJdn: 2304545.5,
    title: {
      'en': 'Nyaungyan takes Yamethin.',
      'my': 'Nyaungyan takes Yamethin.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2304565',
    startJdn: 2304565.5,
    title: {'en': 'Nyaungyan takes Pagan.', 'my': 'Nyaungyan takes Pagan.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2304591',
    startJdn: 2304591.5,
    title: {
      'en': 'Nyaungyan moves into Ava Palace.',
      'my': 'Nyaungyan moves into Ava Palace.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2304610',
    startJdn: 2304610.5,
    title: {
      'en': 'Thado Dhamma Yaza III assassinated.',
      'my': 'Thado Dhamma Yaza III assassinated.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2304893',
    startJdn: 2304893.5,
    title: {
      'en':
          'Nyaungyan orders new construction works at Ava. (Small leap year in Ava)',
      'my':
          'Nyaungyan orders new construction works at Ava. (Small leap year in Ava)',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2305435',
    startJdn: 2305435.5,
    title: {
      'en': 'Nanda surrenders to Toungoo and Arakan.',
      'my': 'Nanda surrenders to Toungoo and Arakan.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2305492',
    startJdn: 2305492.5,
    title: {
      'en': 'Minye Thihathu returns to Toungoo.',
      'my': 'Minye Thihathu returns to Toungoo.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2305574',
    startJdn: 2305574.5,
    title: {
      'en': 'Siamese forces retreat from Toungoo.',
      'my': 'Siamese forces retreat from Toungoo.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2305819',
    startJdn: 2305819.5,
    title: {
      'en': 'Nyaungyan begins campaign to Nyaungshwe.',
      'my': 'Nyaungyan begins campaign to Nyaungshwe.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2306211',
    startJdn: 2306211.5,
    title: {
      'en': 'Nyaungyan visits Shwethalyaung Pagoda.',
      'my': 'Nyaungyan visits Shwethalyaung Pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2306232',
    startJdn: 2306232.5,
    title: {
      'en': 'Campaign to Bhamo begins.',
      'my': 'Campaign to Bhamo begins.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2306629',
    startJdn: 2306629.5,
    title: {
      'en': 'Donates labor at the Sandamuni Pagoda, Ava.',
      'my': 'Donates labor at the Sandamuni Pagoda, Ava.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2306861',
    startJdn: 2306861.5,
    title: {
      'en': 'Donates to the relic chamber of the Sandamuni.',
      'my': 'Donates to the relic chamber of the Sandamuni.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2307344',
    startJdn: 2307344.5,
    title: {
      'en': 'Donates to the relic chamber of the Sandamuni.',
      'my': 'Donates to the relic chamber of the Sandamuni.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2307349',
    startJdn: 2307349.5,
    title: {
      'en': 'Dedicates a steele at the pagoda.',
      'my': 'Dedicates a steele at the pagoda.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2307476',
    startJdn: 2307476.5,
    title: {
      'en': 'Holds court about invasion of Hsenwi, Hsipaw and Mong Mit.',
      'my': 'Holds court about invasion of Hsenwi, Hsipaw and Mong Mit.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2307779',
    startJdn: 2307779.5,
    title: {
      'en':
          'Anaukpetlun holds new umbrella raising ceremony at the Sandamuni .',
      'my':
          'Anaukpetlun holds new umbrella raising ceremony at the Sandamuni .',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2308080',
    startJdn: 2308080.5,
    title: {
      'en': 'Builds monastery for the Bame Sayadaw.',
      'my': 'Builds monastery for the Bame Sayadaw.',
    },
  ),
  ChronicleEntryData(
    id: 'jdn_2308299',
    startJdn: 2308299.5,
    title: {'en': 'Prome campaign begins.', 'my': 'Prome campaign begins.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2308572',
    startJdn: 2308572.5,
    title: {'en': 'Anaukpetlun takes Prome.', 'my': 'Anaukpetlun takes Prome.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2308637',
    startJdn: 2308637.5,
    title: {'en': 'Returns to Ava.', 'my': 'Returns to Ava.'},
  ),
  ChronicleEntryData(
    id: 'jdn_2308783',
    startJdn: 2308783.5,
    title: {
      'en': 'Atula Sanda Dewi becomes chief queen.',
      'my': 'Atula Sanda Dewi becomes chief queen.',
    },
  ),
];
